espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** H264_SYS_CTRL_REG register
 *  H264 system level control register.
 */
#define H264_SYS_CTRL_REG (DR_REG_H264_BASE + 0x0)
/** H264_FRAME_START : WT; bitpos: [0]; default: 0;
 *  Configures whether or not to start encoding one frame.\\0: Invalid. No effect\\1:
 *  Start encoding one frame
 */
#define H264_FRAME_START    (BIT(0))
#define H264_FRAME_START_M  (H264_FRAME_START_V << H264_FRAME_START_S)
#define H264_FRAME_START_V  0x00000001U
#define H264_FRAME_START_S  0
/** H264_DMA_MOVE_START : WT; bitpos: [1]; default: 0;
 *  Configures whether or not to start moving reference data from external mem.\\0:
 *  Invalid. No effect\\1: H264 start moving two MB lines of reference frame from
 *  external mem to internal mem
 */
#define H264_DMA_MOVE_START    (BIT(1))
#define H264_DMA_MOVE_START_M  (H264_DMA_MOVE_START_V << H264_DMA_MOVE_START_S)
#define H264_DMA_MOVE_START_V  0x00000001U
#define H264_DMA_MOVE_START_S  1
/** H264_FRAME_MODE : R/W; bitpos: [2]; default: 0;
 *  Configures H264 running mode. When field H264_DUAL_STREAM_MODE is set to 1, this
 *  field must be set to 1 too.\\0: GOP mode. Before every GOP first frame start, need
 *  reconfig reference frame DMA\\1: Frame mode. Before every frame start, need
 *  reconfig reference frame DMA
 */
#define H264_FRAME_MODE    (BIT(2))
#define H264_FRAME_MODE_M  (H264_FRAME_MODE_V << H264_FRAME_MODE_S)
#define H264_FRAME_MODE_V  0x00000001U
#define H264_FRAME_MODE_S  2
/** H264_SYS_RST_PULSE : WT; bitpos: [3]; default: 0;
 *  Configures whether or not to reset H264 ip.\\0: Invalid. No effect\\1: Reset H264 ip
 */
#define H264_SYS_RST_PULSE    (BIT(3))
#define H264_SYS_RST_PULSE_M  (H264_SYS_RST_PULSE_V << H264_SYS_RST_PULSE_S)
#define H264_SYS_RST_PULSE_V  0x00000001U
#define H264_SYS_RST_PULSE_S  3

/** H264_GOP_CONF_REG register
 *  GOP related configuration register.
 */
#define H264_GOP_CONF_REG (DR_REG_H264_BASE + 0x4)
/** H264_DUAL_STREAM_MODE : R/W; bitpos: [0]; default: 0;
 *  Configures whether or not to enable dual stream mode. When this field is set to 1,
 *  H264_FRAME_MODE field must be set to 1 too.\\0: Normal mode\\1: Dual stream mode
 */
#define H264_DUAL_STREAM_MODE    (BIT(0))
#define H264_DUAL_STREAM_MODE_M  (H264_DUAL_STREAM_MODE_V << H264_DUAL_STREAM_MODE_S)
#define H264_DUAL_STREAM_MODE_V  0x00000001U
#define H264_DUAL_STREAM_MODE_S  0
/** H264_GOP_NUM : R/W; bitpos: [8:1]; default: 0;
 *  Configures the frame number of one GOP.\\0: The frame number of one GOP is
 *  infinite\\Others: Actual frame number of one GOP
 */
#define H264_GOP_NUM    0x000000FFU
#define H264_GOP_NUM_M  (H264_GOP_NUM_V << H264_GOP_NUM_S)
#define H264_GOP_NUM_V  0x000000FFU
#define H264_GOP_NUM_S  1

/** H264_A_SYS_MB_RES_REG register
 *  Video A horizontal and vertical MB resolution register.
 */
#define H264_A_SYS_MB_RES_REG (DR_REG_H264_BASE + 0x8)
/** H264_A_SYS_TOTAL_MB_Y : R/W; bitpos: [6:0]; default: 0;
 *  Configures video A vertical MB resolution.
 */
#define H264_A_SYS_TOTAL_MB_Y    0x0000007FU
#define H264_A_SYS_TOTAL_MB_Y_M  (H264_A_SYS_TOTAL_MB_Y_V << H264_A_SYS_TOTAL_MB_Y_S)
#define H264_A_SYS_TOTAL_MB_Y_V  0x0000007FU
#define H264_A_SYS_TOTAL_MB_Y_S  0
/** H264_A_SYS_TOTAL_MB_X : R/W; bitpos: [13:7]; default: 0;
 *  Configures video A horizontal MB resolution.
 */
#define H264_A_SYS_TOTAL_MB_X    0x0000007FU
#define H264_A_SYS_TOTAL_MB_X_M  (H264_A_SYS_TOTAL_MB_X_V << H264_A_SYS_TOTAL_MB_X_S)
#define H264_A_SYS_TOTAL_MB_X_V  0x0000007FU
#define H264_A_SYS_TOTAL_MB_X_S  7

/** H264_A_SYS_CONF_REG register
 *  Video A system level configuration register.
 */
#define H264_A_SYS_CONF_REG (DR_REG_H264_BASE + 0xc)
/** H264_A_DB_TMP_READY_TRIGGER_MB_NUM : R/W; bitpos: [6:0]; default: 3;
 *  Configures when to trigger  video A H264_DB_TMP_READY_INT. When the (MB number of
 *  written db temp+1) is greater than this filed in first MB line, trigger
 *  H264_DB_TMP_READY_INT. Min is 3.
 */
#define H264_A_DB_TMP_READY_TRIGGER_MB_NUM    0x0000007FU
#define H264_A_DB_TMP_READY_TRIGGER_MB_NUM_M  (H264_A_DB_TMP_READY_TRIGGER_MB_NUM_V << H264_A_DB_TMP_READY_TRIGGER_MB_NUM_S)
#define H264_A_DB_TMP_READY_TRIGGER_MB_NUM_V  0x0000007FU
#define H264_A_DB_TMP_READY_TRIGGER_MB_NUM_S  0
/** H264_A_REC_READY_TRIGGER_MB_LINES : R/W; bitpos: [13:7]; default: 4;
 *  Configures when to trigger  video A H264_REC_READY_INT. When the MB line number of
 *  generated reconstruct pixel is greater than this filed, trigger H264_REC_READY_INT.
 *  Min is 4.
 */
#define H264_A_REC_READY_TRIGGER_MB_LINES    0x0000007FU
#define H264_A_REC_READY_TRIGGER_MB_LINES_M  (H264_A_REC_READY_TRIGGER_MB_LINES_V << H264_A_REC_READY_TRIGGER_MB_LINES_S)
#define H264_A_REC_READY_TRIGGER_MB_LINES_V  0x0000007FU
#define H264_A_REC_READY_TRIGGER_MB_LINES_S  7
/** H264_A_INTRA_COST_CMP_OFFSET : R/W; bitpos: [29:14]; default: 0;
 *  Configures video A intra cost offset when I MB compared with P MB.
 */
#define H264_A_INTRA_COST_CMP_OFFSET    0x0000FFFFU
#define H264_A_INTRA_COST_CMP_OFFSET_M  (H264_A_INTRA_COST_CMP_OFFSET_V << H264_A_INTRA_COST_CMP_OFFSET_S)
#define H264_A_INTRA_COST_CMP_OFFSET_V  0x0000FFFFU
#define H264_A_INTRA_COST_CMP_OFFSET_S  14

/** H264_A_DECI_SCORE_REG register
 *  Video A luma and chroma MB decimate score Register.
 */
#define H264_A_DECI_SCORE_REG (DR_REG_H264_BASE + 0x10)
/** H264_A_C_DECI_SCORE : R/W; bitpos: [9:0]; default: 0;
 *  Configures video A chroma MB decimate score. When chroma score is smaller than it,
 *  chroma decimate will be enable.
 */
#define H264_A_C_DECI_SCORE    0x000003FFU
#define H264_A_C_DECI_SCORE_M  (H264_A_C_DECI_SCORE_V << H264_A_C_DECI_SCORE_S)
#define H264_A_C_DECI_SCORE_V  0x000003FFU
#define H264_A_C_DECI_SCORE_S  0
/** H264_A_L_DECI_SCORE : R/W; bitpos: [19:10]; default: 0;
 *  Configures video A luma MB decimate score. When luma score is smaller than it, luma
 *  decimate will be enable.
 */
#define H264_A_L_DECI_SCORE    0x000003FFU
#define H264_A_L_DECI_SCORE_M  (H264_A_L_DECI_SCORE_V << H264_A_L_DECI_SCORE_S)
#define H264_A_L_DECI_SCORE_V  0x000003FFU
#define H264_A_L_DECI_SCORE_S  10

/** H264_A_DECI_SCORE_OFFSET_REG register
 *  Video A luma and chroma MB decimate score offset Register.
 */
#define H264_A_DECI_SCORE_OFFSET_REG (DR_REG_H264_BASE + 0x14)
/** H264_A_I16X16_DECI_SCORE_OFFSET : R/W; bitpos: [5:0]; default: 0;
 *  Configures video A i16x16 MB decimate score offset. This offset will be added to
 *  i16x16 MB score.
 */
#define H264_A_I16X16_DECI_SCORE_OFFSET    0x0000003FU
#define H264_A_I16X16_DECI_SCORE_OFFSET_M  (H264_A_I16X16_DECI_SCORE_OFFSET_V << H264_A_I16X16_DECI_SCORE_OFFSET_S)
#define H264_A_I16X16_DECI_SCORE_OFFSET_V  0x0000003FU
#define H264_A_I16X16_DECI_SCORE_OFFSET_S  0
/** H264_A_I_CHROMA_DECI_SCORE_OFFSET : R/W; bitpos: [11:6]; default: 0;
 *  Configures video A I chroma MB decimate score offset. This offset will be added to
 *  I chroma MB score.
 */
#define H264_A_I_CHROMA_DECI_SCORE_OFFSET    0x0000003FU
#define H264_A_I_CHROMA_DECI_SCORE_OFFSET_M  (H264_A_I_CHROMA_DECI_SCORE_OFFSET_V << H264_A_I_CHROMA_DECI_SCORE_OFFSET_S)
#define H264_A_I_CHROMA_DECI_SCORE_OFFSET_V  0x0000003FU
#define H264_A_I_CHROMA_DECI_SCORE_OFFSET_S  6
/** H264_A_P16X16_DECI_SCORE_OFFSET : R/W; bitpos: [17:12]; default: 0;
 *  Configures video A p16x16 MB decimate score offset. This offset will be added to
 *  p16x16 MB score.
 */
#define H264_A_P16X16_DECI_SCORE_OFFSET    0x0000003FU
#define H264_A_P16X16_DECI_SCORE_OFFSET_M  (H264_A_P16X16_DECI_SCORE_OFFSET_V << H264_A_P16X16_DECI_SCORE_OFFSET_S)
#define H264_A_P16X16_DECI_SCORE_OFFSET_V  0x0000003FU
#define H264_A_P16X16_DECI_SCORE_OFFSET_S  12
/** H264_A_P_CHROMA_DECI_SCORE_OFFSET : R/W; bitpos: [23:18]; default: 0;
 *  Configures video A p chroma MB decimate score offset. This offset will be added to
 *  p chroma MB score.
 */
#define H264_A_P_CHROMA_DECI_SCORE_OFFSET    0x0000003FU
#define H264_A_P_CHROMA_DECI_SCORE_OFFSET_M  (H264_A_P_CHROMA_DECI_SCORE_OFFSET_V << H264_A_P_CHROMA_DECI_SCORE_OFFSET_S)
#define H264_A_P_CHROMA_DECI_SCORE_OFFSET_V  0x0000003FU
#define H264_A_P_CHROMA_DECI_SCORE_OFFSET_S  18

