espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_reg.h
/** H264_A_RC_CONF0_REG register
 *  Video A rate control configuration register0.
 */
#define H264_A_RC_CONF0_REG (DR_REG_H264_BASE + 0x18)
/** H264_A_QP : R/W; bitpos: [5:0]; default: 0;
 *  Configures video A frame level initial luma QP value.
 */
#define H264_A_QP    0x0000003FU
#define H264_A_QP_M  (H264_A_QP_V << H264_A_QP_S)
#define H264_A_QP_V  0x0000003FU
#define H264_A_QP_S  0
/** H264_A_RATE_CTRL_U : R/W; bitpos: [21:6]; default: 0;
 *  Configures video A parameter U value. U = int((float) u << 8).
 */
#define H264_A_RATE_CTRL_U    0x0000FFFFU
#define H264_A_RATE_CTRL_U_M  (H264_A_RATE_CTRL_U_V << H264_A_RATE_CTRL_U_S)
#define H264_A_RATE_CTRL_U_V  0x0000FFFFU
#define H264_A_RATE_CTRL_U_S  6
/** H264_A_MB_RATE_CTRL_EN : R/W; bitpos: [22]; default: 0;
 *  Configures video A whether or not to open macro block rate ctrl.\\1:Open the macro
 *  block rate ctrl\\1:Close the macro block rate ctrl.
 */
#define H264_A_MB_RATE_CTRL_EN    (BIT(22))
#define H264_A_MB_RATE_CTRL_EN_M  (H264_A_MB_RATE_CTRL_EN_V << H264_A_MB_RATE_CTRL_EN_S)
#define H264_A_MB_RATE_CTRL_EN_V  0x00000001U
#define H264_A_MB_RATE_CTRL_EN_S  22

/** H264_A_RC_CONF1_REG register
 *  Video A rate control configuration register1.
 */
#define H264_A_RC_CONF1_REG (DR_REG_H264_BASE + 0x1c)
/** H264_A_CHROMA_DC_QP_DELTA : R/W; bitpos: [2:0]; default: 0;
 *  Configures video A chroma DC QP offset based on Chroma QP. Chroma DC QP = Chroma
 *  QP(after map) + reg_chroma_dc_qp_delta.
 */
#define H264_A_CHROMA_DC_QP_DELTA    0x00000007U
#define H264_A_CHROMA_DC_QP_DELTA_M  (H264_A_CHROMA_DC_QP_DELTA_V << H264_A_CHROMA_DC_QP_DELTA_S)
#define H264_A_CHROMA_DC_QP_DELTA_V  0x00000007U
#define H264_A_CHROMA_DC_QP_DELTA_S  0
/** H264_A_CHROMA_QP_DELTA : R/W; bitpos: [6:3]; default: 0;
 *  Configures video A chroma QP offset based on luma QP. Chroma QP(before map) = Luma
 *  QP + reg_chroma_qp_delta.
 */
#define H264_A_CHROMA_QP_DELTA    0x0000000FU
#define H264_A_CHROMA_QP_DELTA_M  (H264_A_CHROMA_QP_DELTA_V << H264_A_CHROMA_QP_DELTA_S)
#define H264_A_CHROMA_QP_DELTA_V  0x0000000FU
#define H264_A_CHROMA_QP_DELTA_S  3
/** H264_A_QP_MIN : R/W; bitpos: [12:7]; default: 0;
 *  Configures video A allowed luma QP min value.
 */
#define H264_A_QP_MIN    0x0000003FU
#define H264_A_QP_MIN_M  (H264_A_QP_MIN_V << H264_A_QP_MIN_S)
#define H264_A_QP_MIN_V  0x0000003FU
#define H264_A_QP_MIN_S  7
/** H264_A_QP_MAX : R/W; bitpos: [18:13]; default: 0;
 *  Configures video A allowed luma QP max value.
 */
#define H264_A_QP_MAX    0x0000003FU
#define H264_A_QP_MAX_M  (H264_A_QP_MAX_V << H264_A_QP_MAX_S)
#define H264_A_QP_MAX_V  0x0000003FU
#define H264_A_QP_MAX_S  13
/** H264_A_MAD_FRAME_PRED : R/W; bitpos: [30:19]; default: 0;
 *  Configures vdieo A frame level predicted MB MAD value.
 */
#define H264_A_MAD_FRAME_PRED    0x00000FFFU
#define H264_A_MAD_FRAME_PRED_M  (H264_A_MAD_FRAME_PRED_V << H264_A_MAD_FRAME_PRED_S)
#define H264_A_MAD_FRAME_PRED_V  0x00000FFFU
#define H264_A_MAD_FRAME_PRED_S  19

/** H264_A_DB_BYPASS_REG register
 *  Video A Deblocking bypass register
 */
#define H264_A_DB_BYPASS_REG (DR_REG_H264_BASE + 0x20)
/** H264_A_BYPASS_DB_FILTER : R/W; bitpos: [0]; default: 0;
 *  Configures whether or not to bypass video A deblcoking filter. \\0: Open the
 *  deblock filter\\1: Close the deblock filter
 */
#define H264_A_BYPASS_DB_FILTER    (BIT(0))
#define H264_A_BYPASS_DB_FILTER_M  (H264_A_BYPASS_DB_FILTER_V << H264_A_BYPASS_DB_FILTER_S)
#define H264_A_BYPASS_DB_FILTER_V  0x00000001U
#define H264_A_BYPASS_DB_FILTER_S  0

/** H264_A_ROI_REGION0_REG register
 *  Video A H264 ROI region0 range configure register.
 */
#define H264_A_ROI_REGION0_REG (DR_REG_H264_BASE + 0x24)
/** H264_A_ROI_REGION0_X : R/W; bitpos: [6:0]; default: 0;
 *  Configures the horizontal start macroblocks of region 0 in Video A.
 */
#define H264_A_ROI_REGION0_X    0x0000007FU
#define H264_A_ROI_REGION0_X_M  (H264_A_ROI_REGION0_X_V << H264_A_ROI_REGION0_X_S)
#define H264_A_ROI_REGION0_X_V  0x0000007FU
#define H264_A_ROI_REGION0_X_S  0
/** H264_A_ROI_REGION0_Y : R/W; bitpos: [13:7]; default: 0;
 *  Configures the  vertical start macroblocks of region 0 in Video A.
 */
#define H264_A_ROI_REGION0_Y    0x0000007FU
#define H264_A_ROI_REGION0_Y_M  (H264_A_ROI_REGION0_Y_V << H264_A_ROI_REGION0_Y_S)
#define H264_A_ROI_REGION0_Y_V  0x0000007FU
#define H264_A_ROI_REGION0_Y_S  7
/** H264_A_ROI_REGION0_X_LEN : R/W; bitpos: [20:14]; default: 0;
 *  Configures the number of  macroblocks in horizontal direction of  the region 0 in
 *  Video A.
 */
#define H264_A_ROI_REGION0_X_LEN    0x0000007FU
#define H264_A_ROI_REGION0_X_LEN_M  (H264_A_ROI_REGION0_X_LEN_V << H264_A_ROI_REGION0_X_LEN_S)
#define H264_A_ROI_REGION0_X_LEN_V  0x0000007FU
#define H264_A_ROI_REGION0_X_LEN_S  14
/** H264_A_ROI_REGION0_Y_LEN : R/W; bitpos: [27:21]; default: 0;
 *  Configures the number of  macroblocks in vertical direction of  the region 0 in
 *  Video A.
 */
#define H264_A_ROI_REGION0_Y_LEN    0x0000007FU
#define H264_A_ROI_REGION0_Y_LEN_M  (H264_A_ROI_REGION0_Y_LEN_V << H264_A_ROI_REGION0_Y_LEN_S)
#define H264_A_ROI_REGION0_Y_LEN_V  0x0000007FU
#define H264_A_ROI_REGION0_Y_LEN_S  21
/** H264_A_ROI_REGION0_EN : R/W; bitpos: [28]; default: 0;
 *  Configures whether or not to open Video A ROI of region 0 .\\0:Close ROI\\1:Open
 *  ROI.
 */
#define H264_A_ROI_REGION0_EN    (BIT(28))
#define H264_A_ROI_REGION0_EN_M  (H264_A_ROI_REGION0_EN_V << H264_A_ROI_REGION0_EN_S)
#define H264_A_ROI_REGION0_EN_V  0x00000001U
#define H264_A_ROI_REGION0_EN_S  28

/** H264_A_ROI_REGION1_REG register
 *  Video A H264 ROI region1 range configure register.
 */
#define H264_A_ROI_REGION1_REG (DR_REG_H264_BASE + 0x28)
/** H264_A_ROI_REGION1_X : R/W; bitpos: [6:0]; default: 0;
 *  Configures the horizontal start macroblocks of region 1 in Video A.
 */
#define H264_A_ROI_REGION1_X    0x0000007FU
#define H264_A_ROI_REGION1_X_M  (H264_A_ROI_REGION1_X_V << H264_A_ROI_REGION1_X_S)
#define H264_A_ROI_REGION1_X_V  0x0000007FU
#define H264_A_ROI_REGION1_X_S  0
/** H264_A_ROI_REGION1_Y : R/W; bitpos: [13:7]; default: 0;
 *  Configures the  vertical start macroblocks of region 1 in Video A.
 */
#define H264_A_ROI_REGION1_Y    0x0000007FU
#define H264_A_ROI_REGION1_Y_M  (H264_A_ROI_REGION1_Y_V << H264_A_ROI_REGION1_Y_S)
#define H264_A_ROI_REGION1_Y_V  0x0000007FU
#define H264_A_ROI_REGION1_Y_S  7
/** H264_A_ROI_REGION1_X_LEN : R/W; bitpos: [20:14]; default: 0;
 *  Configures the number of  macroblocks in horizontal direction of  the region 1 in
 *  Video A.
 */
#define H264_A_ROI_REGION1_X_LEN    0x0000007FU
#define H264_A_ROI_REGION1_X_LEN_M  (H264_A_ROI_REGION1_X_LEN_V << H264_A_ROI_REGION1_X_LEN_S)
#define H264_A_ROI_REGION1_X_LEN_V  0x0000007FU
#define H264_A_ROI_REGION1_X_LEN_S  14
/** H264_A_ROI_REGION1_Y_LEN : R/W; bitpos: [27:21]; default: 0;
 *  Configures the number of  macroblocks in vertical direction of  the region 1 in
 *  Video A.
 */
#define H264_A_ROI_REGION1_Y_LEN    0x0000007FU
#define H264_A_ROI_REGION1_Y_LEN_M  (H264_A_ROI_REGION1_Y_LEN_V << H264_A_ROI_REGION1_Y_LEN_S)
#define H264_A_ROI_REGION1_Y_LEN_V  0x0000007FU
#define H264_A_ROI_REGION1_Y_LEN_S  21
/** H264_A_ROI_REGION1_EN : R/W; bitpos: [28]; default: 0;
 *  Configures whether or not to open Video A ROI of region 1 .\\0:Close ROI\\1:Open
 *  ROI.
 */
#define H264_A_ROI_REGION1_EN    (BIT(28))
#define H264_A_ROI_REGION1_EN_M  (H264_A_ROI_REGION1_EN_V << H264_A_ROI_REGION1_EN_S)
#define H264_A_ROI_REGION1_EN_V  0x00000001U
#define H264_A_ROI_REGION1_EN_S  28

