espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_reg.h
/** H264_A_ROI_CONFIG_REG register
 *  Video A H264 ROI configure register.
 */
#define H264_A_ROI_CONFIG_REG (DR_REG_H264_BASE + 0x50)
/** H264_A_ROI_EN : R/W; bitpos: [0]; default: 0;
 *  Configure whether or not to enable ROI in video A.\\0:not enable ROI\\1:enable ROI.
 */
#define H264_A_ROI_EN    (BIT(0))
#define H264_A_ROI_EN_M  (H264_A_ROI_EN_V << H264_A_ROI_EN_S)
#define H264_A_ROI_EN_V  0x00000001U
#define H264_A_ROI_EN_S  0
/** H264_A_ROI_MODE : R/W; bitpos: [1]; default: 0;
 *  Configure the mode of ROI in video A.\\0:fixed qp\\1:delta qp.
 */
#define H264_A_ROI_MODE    (BIT(1))
#define H264_A_ROI_MODE_M  (H264_A_ROI_MODE_V << H264_A_ROI_MODE_S)
#define H264_A_ROI_MODE_V  0x00000001U
#define H264_A_ROI_MODE_S  1

/** H264_B_SYS_MB_RES_REG register
 *  Video B horizontal and vertical MB resolution register.
 */
#define H264_B_SYS_MB_RES_REG (DR_REG_H264_BASE + 0x54)
/** H264_B_SYS_TOTAL_MB_Y : R/W; bitpos: [6:0]; default: 0;
 *  Configures video B vertical MB resolution.
 */
#define H264_B_SYS_TOTAL_MB_Y    0x0000007FU
#define H264_B_SYS_TOTAL_MB_Y_M  (H264_B_SYS_TOTAL_MB_Y_V << H264_B_SYS_TOTAL_MB_Y_S)
#define H264_B_SYS_TOTAL_MB_Y_V  0x0000007FU
#define H264_B_SYS_TOTAL_MB_Y_S  0
/** H264_B_SYS_TOTAL_MB_X : R/W; bitpos: [13:7]; default: 0;
 *  Configures video B horizontal MB resolution.
 */
#define H264_B_SYS_TOTAL_MB_X    0x0000007FU
#define H264_B_SYS_TOTAL_MB_X_M  (H264_B_SYS_TOTAL_MB_X_V << H264_B_SYS_TOTAL_MB_X_S)
#define H264_B_SYS_TOTAL_MB_X_V  0x0000007FU
#define H264_B_SYS_TOTAL_MB_X_S  7

/** H264_B_SYS_CONF_REG register
 *  Video B system level configuration register.
 */
#define H264_B_SYS_CONF_REG (DR_REG_H264_BASE + 0x58)
/** H264_B_DB_TMP_READY_TRIGGER_MB_NUM : R/W; bitpos: [6:0]; default: 3;
 *  Configures when to trigger  video B H264_DB_TMP_READY_INT. When the (MB number of
 *  written db temp+1) is greater than this filed in first MB line, trigger
 *  H264_DB_TMP_READY_INT. Min is 3.
 */
#define H264_B_DB_TMP_READY_TRIGGER_MB_NUM    0x0000007FU
#define H264_B_DB_TMP_READY_TRIGGER_MB_NUM_M  (H264_B_DB_TMP_READY_TRIGGER_MB_NUM_V << H264_B_DB_TMP_READY_TRIGGER_MB_NUM_S)
#define H264_B_DB_TMP_READY_TRIGGER_MB_NUM_V  0x0000007FU
#define H264_B_DB_TMP_READY_TRIGGER_MB_NUM_S  0
/** H264_B_REC_READY_TRIGGER_MB_LINES : R/W; bitpos: [13:7]; default: 4;
 *  Configures when to trigger  video B H264_REC_READY_INT. When the MB line number of
 *  generated reconstruct pixel is greater than this filed, trigger H264_REC_READY_INT.
 *  Min is 4.
 */
#define H264_B_REC_READY_TRIGGER_MB_LINES    0x0000007FU
#define H264_B_REC_READY_TRIGGER_MB_LINES_M  (H264_B_REC_READY_TRIGGER_MB_LINES_V << H264_B_REC_READY_TRIGGER_MB_LINES_S)
#define H264_B_REC_READY_TRIGGER_MB_LINES_V  0x0000007FU
#define H264_B_REC_READY_TRIGGER_MB_LINES_S  7
/** H264_B_INTRA_COST_CMP_OFFSET : R/W; bitpos: [29:14]; default: 0;
 *  Configures video B intra cost offset when I MB compared with P MB.
 */
#define H264_B_INTRA_COST_CMP_OFFSET    0x0000FFFFU
#define H264_B_INTRA_COST_CMP_OFFSET_M  (H264_B_INTRA_COST_CMP_OFFSET_V << H264_B_INTRA_COST_CMP_OFFSET_S)
#define H264_B_INTRA_COST_CMP_OFFSET_V  0x0000FFFFU
#define H264_B_INTRA_COST_CMP_OFFSET_S  14

/** H264_B_DECI_SCORE_REG register
 *  Video B luma and chroma MB decimate score Register.
 */
#define H264_B_DECI_SCORE_REG (DR_REG_H264_BASE + 0x5c)
/** H264_B_C_DECI_SCORE : R/W; bitpos: [9:0]; default: 0;
 *  Configures video B chroma MB decimate score. When chroma score is smaller than it,
 *  chroma decimate will be enable.
 */
#define H264_B_C_DECI_SCORE    0x000003FFU
#define H264_B_C_DECI_SCORE_M  (H264_B_C_DECI_SCORE_V << H264_B_C_DECI_SCORE_S)
#define H264_B_C_DECI_SCORE_V  0x000003FFU
#define H264_B_C_DECI_SCORE_S  0
/** H264_B_L_DECI_SCORE : R/W; bitpos: [19:10]; default: 0;
 *  Configures video B luma MB decimate score. When luma score is smaller than it, luma
 *  decimate will be enable.
 */
#define H264_B_L_DECI_SCORE    0x000003FFU
#define H264_B_L_DECI_SCORE_M  (H264_B_L_DECI_SCORE_V << H264_B_L_DECI_SCORE_S)
#define H264_B_L_DECI_SCORE_V  0x000003FFU
#define H264_B_L_DECI_SCORE_S  10

/** H264_B_DECI_SCORE_OFFSET_REG register
 *  Video B luma and chroma MB decimate score offset Register.
 */
#define H264_B_DECI_SCORE_OFFSET_REG (DR_REG_H264_BASE + 0x60)
/** H264_B_I16X16_DECI_SCORE_OFFSET : R/W; bitpos: [5:0]; default: 0;
 *  Configures video B i16x16 MB decimate score offset. This offset will be added to
 *  i16x16 MB score.
 */
#define H264_B_I16X16_DECI_SCORE_OFFSET    0x0000003FU
#define H264_B_I16X16_DECI_SCORE_OFFSET_M  (H264_B_I16X16_DECI_SCORE_OFFSET_V << H264_B_I16X16_DECI_SCORE_OFFSET_S)
#define H264_B_I16X16_DECI_SCORE_OFFSET_V  0x0000003FU
#define H264_B_I16X16_DECI_SCORE_OFFSET_S  0
/** H264_B_I_CHROMA_DECI_SCORE_OFFSET : R/W; bitpos: [11:6]; default: 0;
 *  Configures video B I chroma MB decimate score offset. This offset will be added to
 *  I chroma MB score.
 */
#define H264_B_I_CHROMA_DECI_SCORE_OFFSET    0x0000003FU
#define H264_B_I_CHROMA_DECI_SCORE_OFFSET_M  (H264_B_I_CHROMA_DECI_SCORE_OFFSET_V << H264_B_I_CHROMA_DECI_SCORE_OFFSET_S)
#define H264_B_I_CHROMA_DECI_SCORE_OFFSET_V  0x0000003FU
#define H264_B_I_CHROMA_DECI_SCORE_OFFSET_S  6
/** H264_B_P16X16_DECI_SCORE_OFFSET : R/W; bitpos: [17:12]; default: 0;
 *  Configures video B p16x16 MB decimate score offset. This offset will be added to
 *  p16x16 MB score.
 */
#define H264_B_P16X16_DECI_SCORE_OFFSET    0x0000003FU
#define H264_B_P16X16_DECI_SCORE_OFFSET_M  (H264_B_P16X16_DECI_SCORE_OFFSET_V << H264_B_P16X16_DECI_SCORE_OFFSET_S)
#define H264_B_P16X16_DECI_SCORE_OFFSET_V  0x0000003FU
#define H264_B_P16X16_DECI_SCORE_OFFSET_S  12
/** H264_B_P_CHROMA_DECI_SCORE_OFFSET : R/W; bitpos: [23:18]; default: 0;
 *  Configures video B p chroma MB decimate score offset. This offset will be added to
 *  p chroma MB score.
 */
#define H264_B_P_CHROMA_DECI_SCORE_OFFSET    0x0000003FU
#define H264_B_P_CHROMA_DECI_SCORE_OFFSET_M  (H264_B_P_CHROMA_DECI_SCORE_OFFSET_V << H264_B_P_CHROMA_DECI_SCORE_OFFSET_S)
#define H264_B_P_CHROMA_DECI_SCORE_OFFSET_V  0x0000003FU
#define H264_B_P_CHROMA_DECI_SCORE_OFFSET_S  18

/** H264_B_RC_CONF0_REG register
 *  Video B rate control configuration register0.
 */
#define H264_B_RC_CONF0_REG (DR_REG_H264_BASE + 0x64)
/** H264_B_QP : R/W; bitpos: [5:0]; default: 0;
 *  Configures video B frame level initial luma QP value.
 */
#define H264_B_QP    0x0000003FU
#define H264_B_QP_M  (H264_B_QP_V << H264_B_QP_S)
#define H264_B_QP_V  0x0000003FU
#define H264_B_QP_S  0
/** H264_B_RATE_CTRL_U : R/W; bitpos: [21:6]; default: 0;
 *  Configures video B parameter U value. U = int((float) u << 8).
 */
#define H264_B_RATE_CTRL_U    0x0000FFFFU
#define H264_B_RATE_CTRL_U_M  (H264_B_RATE_CTRL_U_V << H264_B_RATE_CTRL_U_S)
#define H264_B_RATE_CTRL_U_V  0x0000FFFFU
#define H264_B_RATE_CTRL_U_S  6
/** H264_B_MB_RATE_CTRL_EN : R/W; bitpos: [22]; default: 0;
 *  Configures video A whether or not to open macro block rate ctrl.\\1:Open the macro
 *  block rate ctrl\\1:Close the macro block rate ctrl.
 */
#define H264_B_MB_RATE_CTRL_EN    (BIT(22))
#define H264_B_MB_RATE_CTRL_EN_M  (H264_B_MB_RATE_CTRL_EN_V << H264_B_MB_RATE_CTRL_EN_S)
#define H264_B_MB_RATE_CTRL_EN_V  0x00000001U
#define H264_B_MB_RATE_CTRL_EN_S  22

/** H264_B_RC_CONF1_REG register
 *  Video B rate control configuration register1.
 */
#define H264_B_RC_CONF1_REG (DR_REG_H264_BASE + 0x68)
/** H264_B_CHROMA_DC_QP_DELTA : R/W; bitpos: [2:0]; default: 0;
 *  Configures video B chroma DC QP offset based on Chroma QP. Chroma DC QP = Chroma
 *  QP(after map) + reg_chroma_dc_qp_delta.
 */
#define H264_B_CHROMA_DC_QP_DELTA    0x00000007U
#define H264_B_CHROMA_DC_QP_DELTA_M  (H264_B_CHROMA_DC_QP_DELTA_V << H264_B_CHROMA_DC_QP_DELTA_S)
#define H264_B_CHROMA_DC_QP_DELTA_V  0x00000007U
#define H264_B_CHROMA_DC_QP_DELTA_S  0
/** H264_B_CHROMA_QP_DELTA : R/W; bitpos: [6:3]; default: 0;
 *  Configures video B chroma QP offset based on luma QP. Chroma QP(before map) = Luma
 *  QP + reg_chroma_qp_delta.
 */
#define H264_B_CHROMA_QP_DELTA    0x0000000FU
#define H264_B_CHROMA_QP_DELTA_M  (H264_B_CHROMA_QP_DELTA_V << H264_B_CHROMA_QP_DELTA_S)
#define H264_B_CHROMA_QP_DELTA_V  0x0000000FU
#define H264_B_CHROMA_QP_DELTA_S  3
/** H264_B_QP_MIN : R/W; bitpos: [12:7]; default: 0;
 *  Configures video B allowed luma QP min value.
 */
#define H264_B_QP_MIN    0x0000003FU
#define H264_B_QP_MIN_M  (H264_B_QP_MIN_V << H264_B_QP_MIN_S)
#define H264_B_QP_MIN_V  0x0000003FU
#define H264_B_QP_MIN_S  7
/** H264_B_QP_MAX : R/W; bitpos: [18:13]; default: 0;
 *  Configures video B allowed luma QP max value.
 */
#define H264_B_QP_MAX    0x0000003FU
#define H264_B_QP_MAX_M  (H264_B_QP_MAX_V << H264_B_QP_MAX_S)
#define H264_B_QP_MAX_V  0x0000003FU
#define H264_B_QP_MAX_S  13
/** H264_B_MAD_FRAME_PRED : R/W; bitpos: [30:19]; default: 0;
 *  Configures vdieo B frame level predicted MB MAD value.
 */
#define H264_B_MAD_FRAME_PRED    0x00000FFFU
#define H264_B_MAD_FRAME_PRED_M  (H264_B_MAD_FRAME_PRED_V << H264_B_MAD_FRAME_PRED_S)
#define H264_B_MAD_FRAME_PRED_V  0x00000FFFU
#define H264_B_MAD_FRAME_PRED_S  19

/** H264_B_DB_BYPASS_REG register
 *  Video B Deblocking bypass register
 */
#define H264_B_DB_BYPASS_REG (DR_REG_H264_BASE + 0x6c)
/** H264_B_BYPASS_DB_FILTER : R/W; bitpos: [0]; default: 0;
 *  Configures whether or not to bypass video B deblcoking filter. \\0: Open the
 *  deblock filter\\1: Close the deblock filter
 */
#define H264_B_BYPASS_DB_FILTER    (BIT(0))
#define H264_B_BYPASS_DB_FILTER_M  (H264_B_BYPASS_DB_FILTER_V << H264_B_BYPASS_DB_FILTER_S)
#define H264_B_BYPASS_DB_FILTER_V  0x00000001U
#define H264_B_BYPASS_DB_FILTER_S  0

/** H264_B_ROI_REGION0_REG register
 *  Video B H264 ROI region0 range configure register.
 */
#define H264_B_ROI_REGION0_REG (DR_REG_H264_BASE + 0x70)
/** H264_B_ROI_REGION0_X : R/W; bitpos: [6:0]; default: 0;
 *  Configures the horizontal start macroblocks of region 0 in Video B.
 */
#define H264_B_ROI_REGION0_X    0x0000007FU
#define H264_B_ROI_REGION0_X_M  (H264_B_ROI_REGION0_X_V << H264_B_ROI_REGION0_X_S)
#define H264_B_ROI_REGION0_X_V  0x0000007FU
#define H264_B_ROI_REGION0_X_S  0
/** H264_B_ROI_REGION0_Y : R/W; bitpos: [13:7]; default: 0;
 *  Configures the  vertical start macroblocks of region 0 in Video B.
 */
#define H264_B_ROI_REGION0_Y    0x0000007FU
#define H264_B_ROI_REGION0_Y_M  (H264_B_ROI_REGION0_Y_V << H264_B_ROI_REGION0_Y_S)
#define H264_B_ROI_REGION0_Y_V  0x0000007FU
#define H264_B_ROI_REGION0_Y_S  7
/** H264_B_ROI_REGION0_X_LEN : R/W; bitpos: [20:14]; default: 0;
 *  Configures the number of  macroblocks in horizontal direction of  the region 0 in
 *  Video B.
 */
#define H264_B_ROI_REGION0_X_LEN    0x0000007FU
#define H264_B_ROI_REGION0_X_LEN_M  (H264_B_ROI_REGION0_X_LEN_V << H264_B_ROI_REGION0_X_LEN_S)
#define H264_B_ROI_REGION0_X_LEN_V  0x0000007FU
#define H264_B_ROI_REGION0_X_LEN_S  14
/** H264_B_ROI_REGION0_Y_LEN : R/W; bitpos: [27:21]; default: 0;
 *  Configures the number of  macroblocks in vertical direction of  the region 0 in
 *  Video B.
 */
#define H264_B_ROI_REGION0_Y_LEN    0x0000007FU
#define H264_B_ROI_REGION0_Y_LEN_M  (H264_B_ROI_REGION0_Y_LEN_V << H264_B_ROI_REGION0_Y_LEN_S)
#define H264_B_ROI_REGION0_Y_LEN_V  0x0000007FU
#define H264_B_ROI_REGION0_Y_LEN_S  21
/** H264_B_ROI_REGION0_EN : R/W; bitpos: [28]; default: 0;
 *  Configures whether or not to open Video B ROI of region 0 .\\0:Close ROI\\1:Open
 *  ROI.
 */
#define H264_B_ROI_REGION0_EN    (BIT(28))
#define H264_B_ROI_REGION0_EN_M  (H264_B_ROI_REGION0_EN_V << H264_B_ROI_REGION0_EN_S)
#define H264_B_ROI_REGION0_EN_V  0x00000001U
#define H264_B_ROI_REGION0_EN_S  28

/** H264_B_ROI_REGION1_REG register
 *  Video B H264 ROI region1 range configure register.
 */
#define H264_B_ROI_REGION1_REG (DR_REG_H264_BASE + 0x74)
/** H264_B_ROI_REGION1_X : R/W; bitpos: [6:0]; default: 0;
 *  Configures the horizontal start macroblocks of region 1 in Video B.
 */
#define H264_B_ROI_REGION1_X    0x0000007FU
#define H264_B_ROI_REGION1_X_M  (H264_B_ROI_REGION1_X_V << H264_B_ROI_REGION1_X_S)
#define H264_B_ROI_REGION1_X_V  0x0000007FU
#define H264_B_ROI_REGION1_X_S  0
/** H264_B_ROI_REGION1_Y : R/W; bitpos: [13:7]; default: 0;
 *  Configures the  vertical start macroblocks of region 1 in Video B.
 */
#define H264_B_ROI_REGION1_Y    0x0000007FU
#define H264_B_ROI_REGION1_Y_M  (H264_B_ROI_REGION1_Y_V << H264_B_ROI_REGION1_Y_S)
#define H264_B_ROI_REGION1_Y_V  0x0000007FU
#define H264_B_ROI_REGION1_Y_S  7
/** H264_B_ROI_REGION1_X_LEN : R/W; bitpos: [20:14]; default: 0;
 *  Configures the number of  macroblocks in horizontal direction of  the region 1 in
 *  Video B.
 */
#define H264_B_ROI_REGION1_X_LEN    0x0000007FU
#define H264_B_ROI_REGION1_X_LEN_M  (H264_B_ROI_REGION1_X_LEN_V << H264_B_ROI_REGION1_X_LEN_S)
#define H264_B_ROI_REGION1_X_LEN_V  0x0000007FU
#define H264_B_ROI_REGION1_X_LEN_S  14
/** H264_B_ROI_REGION1_Y_LEN : R/W; bitpos: [27:21]; default: 0;
 *  Configures the number of  macroblocks in vertical direction of  the region 1 in
 *  Video B.
 */
#define H264_B_ROI_REGION1_Y_LEN    0x0000007FU
#define H264_B_ROI_REGION1_Y_LEN_M  (H264_B_ROI_REGION1_Y_LEN_V << H264_B_ROI_REGION1_Y_LEN_S)
#define H264_B_ROI_REGION1_Y_LEN_V  0x0000007FU
#define H264_B_ROI_REGION1_Y_LEN_S  21
/** H264_B_ROI_REGION1_EN : R/W; bitpos: [28]; default: 0;
 *  Configures whether or not to open Video B ROI of region 1 .\\0:Close ROI\\1:Open
 *  ROI.
 */
#define H264_B_ROI_REGION1_EN    (BIT(28))
#define H264_B_ROI_REGION1_EN_M  (H264_B_ROI_REGION1_EN_V << H264_B_ROI_REGION1_EN_S)
#define H264_B_ROI_REGION1_EN_V  0x00000001U
#define H264_B_ROI_REGION1_EN_S  28

