espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_reg.h
/** H264_B_ROI_REGION2_REG register
 *  Video B H264 ROI region2 range configure register.
 */
#define H264_B_ROI_REGION2_REG (DR_REG_H264_BASE + 0x78)
/** H264_B_ROI_REGION2_X : R/W; bitpos: [6:0]; default: 0;
 *  Configures the horizontal start macroblocks of region 2 in Video B.
 */
#define H264_B_ROI_REGION2_X    0x0000007FU
#define H264_B_ROI_REGION2_X_M  (H264_B_ROI_REGION2_X_V << H264_B_ROI_REGION2_X_S)
#define H264_B_ROI_REGION2_X_V  0x0000007FU
#define H264_B_ROI_REGION2_X_S  0
/** H264_B_ROI_REGION2_Y : R/W; bitpos: [13:7]; default: 0;
 *  Configures the  vertical start macroblocks of region 2 in Video B.
 */
#define H264_B_ROI_REGION2_Y    0x0000007FU
#define H264_B_ROI_REGION2_Y_M  (H264_B_ROI_REGION2_Y_V << H264_B_ROI_REGION2_Y_S)
#define H264_B_ROI_REGION2_Y_V  0x0000007FU
#define H264_B_ROI_REGION2_Y_S  7
/** H264_B_ROI_REGION2_X_LEN : R/W; bitpos: [20:14]; default: 0;
 *  Configures the number of  macroblocks in horizontal direction of  the region 2 in
 *  Video B.
 */
#define H264_B_ROI_REGION2_X_LEN    0x0000007FU
#define H264_B_ROI_REGION2_X_LEN_M  (H264_B_ROI_REGION2_X_LEN_V << H264_B_ROI_REGION2_X_LEN_S)
#define H264_B_ROI_REGION2_X_LEN_V  0x0000007FU
#define H264_B_ROI_REGION2_X_LEN_S  14
/** H264_B_ROI_REGION2_Y_LEN : R/W; bitpos: [27:21]; default: 0;
 *  Configures the number of  macroblocks in vertical direction of  the region 2 in
 *  Video B.
 */
#define H264_B_ROI_REGION2_Y_LEN    0x0000007FU
#define H264_B_ROI_REGION2_Y_LEN_M  (H264_B_ROI_REGION2_Y_LEN_V << H264_B_ROI_REGION2_Y_LEN_S)
#define H264_B_ROI_REGION2_Y_LEN_V  0x0000007FU
#define H264_B_ROI_REGION2_Y_LEN_S  21
/** H264_B_ROI_REGION2_EN : R/W; bitpos: [28]; default: 0;
 *  Configures whether or not to open Video B ROI of region 2 .\\0:Close ROI\\1:Open
 *  ROI.
 */
#define H264_B_ROI_REGION2_EN    (BIT(28))
#define H264_B_ROI_REGION2_EN_M  (H264_B_ROI_REGION2_EN_V << H264_B_ROI_REGION2_EN_S)
#define H264_B_ROI_REGION2_EN_V  0x00000001U
#define H264_B_ROI_REGION2_EN_S  28

/** H264_B_ROI_REGION3_REG register
 *  Video B H264 ROI region3 range configure register.
 */
#define H264_B_ROI_REGION3_REG (DR_REG_H264_BASE + 0x7c)
/** H264_B_ROI_REGION3_X : R/W; bitpos: [6:0]; default: 0;
 *  Configures the horizontal start macroblocks of region 3 in Video B.
 */
#define H264_B_ROI_REGION3_X    0x0000007FU
#define H264_B_ROI_REGION3_X_M  (H264_B_ROI_REGION3_X_V << H264_B_ROI_REGION3_X_S)
#define H264_B_ROI_REGION3_X_V  0x0000007FU
#define H264_B_ROI_REGION3_X_S  0
/** H264_B_ROI_REGION3_Y : R/W; bitpos: [13:7]; default: 0;
 *  Configures the  vertical start macroblocks of region 3 in Video B.
 */
#define H264_B_ROI_REGION3_Y    0x0000007FU
#define H264_B_ROI_REGION3_Y_M  (H264_B_ROI_REGION3_Y_V << H264_B_ROI_REGION3_Y_S)
#define H264_B_ROI_REGION3_Y_V  0x0000007FU
#define H264_B_ROI_REGION3_Y_S  7
/** H264_B_ROI_REGION3_X_LEN : R/W; bitpos: [20:14]; default: 0;
 *  Configures the number of  macroblocks in horizontal direction of  the region 3 in
 *  video B.
 */
#define H264_B_ROI_REGION3_X_LEN    0x0000007FU
#define H264_B_ROI_REGION3_X_LEN_M  (H264_B_ROI_REGION3_X_LEN_V << H264_B_ROI_REGION3_X_LEN_S)
#define H264_B_ROI_REGION3_X_LEN_V  0x0000007FU
#define H264_B_ROI_REGION3_X_LEN_S  14
/** H264_B_ROI_REGION3_Y_LEN : R/W; bitpos: [27:21]; default: 0;
 *  Configures the number of  macroblocks in vertical direction of  the region 3 in
 *  video B.
 */
#define H264_B_ROI_REGION3_Y_LEN    0x0000007FU
#define H264_B_ROI_REGION3_Y_LEN_M  (H264_B_ROI_REGION3_Y_LEN_V << H264_B_ROI_REGION3_Y_LEN_S)
#define H264_B_ROI_REGION3_Y_LEN_V  0x0000007FU
#define H264_B_ROI_REGION3_Y_LEN_S  21
/** H264_B_ROI_REGION3_EN : R/W; bitpos: [28]; default: 0;
 *  Configures whether or not to open Video B ROI of region 3 .\\0:Close ROI\\1:Open
 *  ROI.
 */
#define H264_B_ROI_REGION3_EN    (BIT(28))
#define H264_B_ROI_REGION3_EN_M  (H264_B_ROI_REGION3_EN_V << H264_B_ROI_REGION3_EN_S)
#define H264_B_ROI_REGION3_EN_V  0x00000001U
#define H264_B_ROI_REGION3_EN_S  28

/** H264_B_ROI_REGION4_REG register
 *  Video B H264 ROI region4 range configure register.
 */
#define H264_B_ROI_REGION4_REG (DR_REG_H264_BASE + 0x80)
/** H264_B_ROI_REGION4_X : R/W; bitpos: [6:0]; default: 0;
 *  Configures the horizontal start macroblocks of region 4 in Video B.
 */
#define H264_B_ROI_REGION4_X    0x0000007FU
#define H264_B_ROI_REGION4_X_M  (H264_B_ROI_REGION4_X_V << H264_B_ROI_REGION4_X_S)
#define H264_B_ROI_REGION4_X_V  0x0000007FU
#define H264_B_ROI_REGION4_X_S  0
/** H264_B_ROI_REGION4_Y : R/W; bitpos: [13:7]; default: 0;
 *  Configures the  vertical start macroblocks of region 4 in Video B.
 */
#define H264_B_ROI_REGION4_Y    0x0000007FU
#define H264_B_ROI_REGION4_Y_M  (H264_B_ROI_REGION4_Y_V << H264_B_ROI_REGION4_Y_S)
#define H264_B_ROI_REGION4_Y_V  0x0000007FU
#define H264_B_ROI_REGION4_Y_S  7
/** H264_B_ROI_REGION4_X_LEN : R/W; bitpos: [20:14]; default: 0;
 *  Configures the number of  macroblocks in horizontal direction of  the region 4 in
 *  video B.
 */
#define H264_B_ROI_REGION4_X_LEN    0x0000007FU
#define H264_B_ROI_REGION4_X_LEN_M  (H264_B_ROI_REGION4_X_LEN_V << H264_B_ROI_REGION4_X_LEN_S)
#define H264_B_ROI_REGION4_X_LEN_V  0x0000007FU
#define H264_B_ROI_REGION4_X_LEN_S  14
/** H264_B_ROI_REGION4_Y_LEN : R/W; bitpos: [27:21]; default: 0;
 *  Configures the number of  macroblocks in vertical direction of  the region 4 in
 *  video B.
 */
#define H264_B_ROI_REGION4_Y_LEN    0x0000007FU
#define H264_B_ROI_REGION4_Y_LEN_M  (H264_B_ROI_REGION4_Y_LEN_V << H264_B_ROI_REGION4_Y_LEN_S)
#define H264_B_ROI_REGION4_Y_LEN_V  0x0000007FU
#define H264_B_ROI_REGION4_Y_LEN_S  21
/** H264_B_ROI_REGION4_EN : R/W; bitpos: [28]; default: 0;
 *  Configures whether or not to open Video B ROI of region 4 .\\0:Close ROI\\1:Open
 *  ROI.
 */
#define H264_B_ROI_REGION4_EN    (BIT(28))
#define H264_B_ROI_REGION4_EN_M  (H264_B_ROI_REGION4_EN_V << H264_B_ROI_REGION4_EN_S)
#define H264_B_ROI_REGION4_EN_V  0x00000001U
#define H264_B_ROI_REGION4_EN_S  28

/** H264_B_ROI_REGION5_REG register
 *  Video B H264 ROI region5 range configure register.
 */
#define H264_B_ROI_REGION5_REG (DR_REG_H264_BASE + 0x84)
/** H264_B_ROI_REGION5_X : R/W; bitpos: [6:0]; default: 0;
 *  Configures the horizontial start macroblocks of region 5 video B.
 */
#define H264_B_ROI_REGION5_X    0x0000007FU
#define H264_B_ROI_REGION5_X_M  (H264_B_ROI_REGION5_X_V << H264_B_ROI_REGION5_X_S)
#define H264_B_ROI_REGION5_X_V  0x0000007FU
#define H264_B_ROI_REGION5_X_S  0
/** H264_B_ROI_REGION5_Y : R/W; bitpos: [13:7]; default: 0;
 *  Configures the  vertical start macroblocks of region 5 video B.
 */
#define H264_B_ROI_REGION5_Y    0x0000007FU
#define H264_B_ROI_REGION5_Y_M  (H264_B_ROI_REGION5_Y_V << H264_B_ROI_REGION5_Y_S)
#define H264_B_ROI_REGION5_Y_V  0x0000007FU
#define H264_B_ROI_REGION5_Y_S  7
/** H264_B_ROI_REGION5_X_LEN : R/W; bitpos: [20:14]; default: 0;
 *  Configures the number of  macroblocks in horizontal direction of  the region 5
 *  video B.
 */
#define H264_B_ROI_REGION5_X_LEN    0x0000007FU
#define H264_B_ROI_REGION5_X_LEN_M  (H264_B_ROI_REGION5_X_LEN_V << H264_B_ROI_REGION5_X_LEN_S)
#define H264_B_ROI_REGION5_X_LEN_V  0x0000007FU
#define H264_B_ROI_REGION5_X_LEN_S  14
/** H264_B_ROI_REGION5_Y_LEN : R/W; bitpos: [27:21]; default: 0;
 *  Configures the number of  macroblocks in vertical direction of  the region 5 in
 *  video B.
 */
#define H264_B_ROI_REGION5_Y_LEN    0x0000007FU
#define H264_B_ROI_REGION5_Y_LEN_M  (H264_B_ROI_REGION5_Y_LEN_V << H264_B_ROI_REGION5_Y_LEN_S)
#define H264_B_ROI_REGION5_Y_LEN_V  0x0000007FU
#define H264_B_ROI_REGION5_Y_LEN_S  21
/** H264_B_ROI_REGION5_EN : R/W; bitpos: [28]; default: 0;
 *  Configures whether or not to open Video B ROI of region 5 .\\0:Close ROI\\1:Open
 *  ROI.
 */
#define H264_B_ROI_REGION5_EN    (BIT(28))
#define H264_B_ROI_REGION5_EN_M  (H264_B_ROI_REGION5_EN_V << H264_B_ROI_REGION5_EN_S)
#define H264_B_ROI_REGION5_EN_V  0x00000001U
#define H264_B_ROI_REGION5_EN_S  28

/** H264_B_ROI_REGION6_REG register
 *  Video B H264 ROI region6 range configure register.
 */
#define H264_B_ROI_REGION6_REG (DR_REG_H264_BASE + 0x88)
/** H264_B_ROI_REGION6_X : R/W; bitpos: [6:0]; default: 0;
 *  Configures the horizontial start macroblocks of region 6 video B.
 */
#define H264_B_ROI_REGION6_X    0x0000007FU
#define H264_B_ROI_REGION6_X_M  (H264_B_ROI_REGION6_X_V << H264_B_ROI_REGION6_X_S)
#define H264_B_ROI_REGION6_X_V  0x0000007FU
#define H264_B_ROI_REGION6_X_S  0
/** H264_B_ROI_REGION6_Y : R/W; bitpos: [13:7]; default: 0;
 *  Configures the  vertical start macroblocks of region 6 in video B.
 */
#define H264_B_ROI_REGION6_Y    0x0000007FU
#define H264_B_ROI_REGION6_Y_M  (H264_B_ROI_REGION6_Y_V << H264_B_ROI_REGION6_Y_S)
#define H264_B_ROI_REGION6_Y_V  0x0000007FU
#define H264_B_ROI_REGION6_Y_S  7
/** H264_B_ROI_REGION6_X_LEN : R/W; bitpos: [20:14]; default: 0;
 *  Configures the number of  macroblocks in horizontal direction of  the region 6 in
 *  video B.
 */
#define H264_B_ROI_REGION6_X_LEN    0x0000007FU
#define H264_B_ROI_REGION6_X_LEN_M  (H264_B_ROI_REGION6_X_LEN_V << H264_B_ROI_REGION6_X_LEN_S)
#define H264_B_ROI_REGION6_X_LEN_V  0x0000007FU
#define H264_B_ROI_REGION6_X_LEN_S  14
/** H264_B_ROI_REGION6_Y_LEN : R/W; bitpos: [27:21]; default: 0;
 *  Configures the number of  macroblocks in vertical direction of  the region 6 in
 *  video B.
 */
#define H264_B_ROI_REGION6_Y_LEN    0x0000007FU
#define H264_B_ROI_REGION6_Y_LEN_M  (H264_B_ROI_REGION6_Y_LEN_V << H264_B_ROI_REGION6_Y_LEN_S)
#define H264_B_ROI_REGION6_Y_LEN_V  0x0000007FU
#define H264_B_ROI_REGION6_Y_LEN_S  21
/** H264_B_ROI_REGION6_EN : R/W; bitpos: [28]; default: 0;
 *  Configures whether or not to open Video B ROI of region 6 .\\0:Close ROI\\1:Open
 *  ROI.
 */
#define H264_B_ROI_REGION6_EN    (BIT(28))
#define H264_B_ROI_REGION6_EN_M  (H264_B_ROI_REGION6_EN_V << H264_B_ROI_REGION6_EN_S)
#define H264_B_ROI_REGION6_EN_V  0x00000001U
#define H264_B_ROI_REGION6_EN_S  28

/** H264_B_ROI_REGION7_REG register
 *  Video B H264 ROI region7 range configure register.
 */
#define H264_B_ROI_REGION7_REG (DR_REG_H264_BASE + 0x8c)
/** H264_B_ROI_REGION7_X : R/W; bitpos: [6:0]; default: 0;
 *  Configures the horizontal start macroblocks of region 7 in video B.
 */
#define H264_B_ROI_REGION7_X    0x0000007FU
#define H264_B_ROI_REGION7_X_M  (H264_B_ROI_REGION7_X_V << H264_B_ROI_REGION7_X_S)
#define H264_B_ROI_REGION7_X_V  0x0000007FU
#define H264_B_ROI_REGION7_X_S  0
/** H264_B_ROI_REGION7_Y : R/W; bitpos: [13:7]; default: 0;
 *  Configures the  vertical start macroblocks of region 7 in video B.
 */
#define H264_B_ROI_REGION7_Y    0x0000007FU
#define H264_B_ROI_REGION7_Y_M  (H264_B_ROI_REGION7_Y_V << H264_B_ROI_REGION7_Y_S)
#define H264_B_ROI_REGION7_Y_V  0x0000007FU
#define H264_B_ROI_REGION7_Y_S  7
/** H264_B_ROI_REGION7_X_LEN : R/W; bitpos: [20:14]; default: 0;
 *  Configures the number of  macroblocks in horizontal direction of  the region 7 in
 *  video B.
 */
#define H264_B_ROI_REGION7_X_LEN    0x0000007FU
#define H264_B_ROI_REGION7_X_LEN_M  (H264_B_ROI_REGION7_X_LEN_V << H264_B_ROI_REGION7_X_LEN_S)
#define H264_B_ROI_REGION7_X_LEN_V  0x0000007FU
#define H264_B_ROI_REGION7_X_LEN_S  14
/** H264_B_ROI_REGION7_Y_LEN : R/W; bitpos: [27:21]; default: 0;
 *  Configures the number of  macroblocks in vertical direction of  the region 7 in
 *  video B.
 */
#define H264_B_ROI_REGION7_Y_LEN    0x0000007FU
#define H264_B_ROI_REGION7_Y_LEN_M  (H264_B_ROI_REGION7_Y_LEN_V << H264_B_ROI_REGION7_Y_LEN_S)
#define H264_B_ROI_REGION7_Y_LEN_V  0x0000007FU
#define H264_B_ROI_REGION7_Y_LEN_S  21
/** H264_B_ROI_REGION7_EN : R/W; bitpos: [28]; default: 0;
 *  Configures whether or not to open Video B ROI of region 7 .\\0:Close ROI\\1:Open
 *  ROI.
 */
#define H264_B_ROI_REGION7_EN    (BIT(28))
#define H264_B_ROI_REGION7_EN_M  (H264_B_ROI_REGION7_EN_V << H264_B_ROI_REGION7_EN_S)
#define H264_B_ROI_REGION7_EN_V  0x00000001U
#define H264_B_ROI_REGION7_EN_S  28

