espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_reg.h
/** H264_B_ROI_REGION0_3_QP_REG register
 *  Video B H264 ROI region0, region1,region2,region3 QP register.
 */
#define H264_B_ROI_REGION0_3_QP_REG (DR_REG_H264_BASE + 0x90)
/** H264_B_ROI_REGION0_QP : R/W; bitpos: [6:0]; default: 0;
 *  Configure H264 ROI region0 qp in video B,fixed qp or delta qp.
 */
#define H264_B_ROI_REGION0_QP    0x0000007FU
#define H264_B_ROI_REGION0_QP_M  (H264_B_ROI_REGION0_QP_V << H264_B_ROI_REGION0_QP_S)
#define H264_B_ROI_REGION0_QP_V  0x0000007FU
#define H264_B_ROI_REGION0_QP_S  0
/** H264_B_ROI_REGION1_QP : R/W; bitpos: [13:7]; default: 0;
 *  Configure H264 ROI region1 qp in video B,fixed qp or delta qp.
 */
#define H264_B_ROI_REGION1_QP    0x0000007FU
#define H264_B_ROI_REGION1_QP_M  (H264_B_ROI_REGION1_QP_V << H264_B_ROI_REGION1_QP_S)
#define H264_B_ROI_REGION1_QP_V  0x0000007FU
#define H264_B_ROI_REGION1_QP_S  7
/** H264_B_ROI_REGION2_QP : R/W; bitpos: [20:14]; default: 0;
 *  Configure H264 ROI region2 qp in video B,fixed qp or delta qp.
 */
#define H264_B_ROI_REGION2_QP    0x0000007FU
#define H264_B_ROI_REGION2_QP_M  (H264_B_ROI_REGION2_QP_V << H264_B_ROI_REGION2_QP_S)
#define H264_B_ROI_REGION2_QP_V  0x0000007FU
#define H264_B_ROI_REGION2_QP_S  14
/** H264_B_ROI_REGION3_QP : R/W; bitpos: [27:21]; default: 0;
 *  Configure H264 ROI region3 qp in video B,fixed qp or delta qp.
 */
#define H264_B_ROI_REGION3_QP    0x0000007FU
#define H264_B_ROI_REGION3_QP_M  (H264_B_ROI_REGION3_QP_V << H264_B_ROI_REGION3_QP_S)
#define H264_B_ROI_REGION3_QP_V  0x0000007FU
#define H264_B_ROI_REGION3_QP_S  21

/** H264_B_ROI_REGION4_7_QP_REG register
 *  Video B H264 ROI region4, region5,region6,region7 QP register.
 */
#define H264_B_ROI_REGION4_7_QP_REG (DR_REG_H264_BASE + 0x94)
/** H264_B_ROI_REGION4_QP : R/W; bitpos: [6:0]; default: 0;
 *  Configure H264 ROI region4 qp in video B,fixed qp or delta qp.
 */
#define H264_B_ROI_REGION4_QP    0x0000007FU
#define H264_B_ROI_REGION4_QP_M  (H264_B_ROI_REGION4_QP_V << H264_B_ROI_REGION4_QP_S)
#define H264_B_ROI_REGION4_QP_V  0x0000007FU
#define H264_B_ROI_REGION4_QP_S  0
/** H264_B_ROI_REGION5_QP : R/W; bitpos: [13:7]; default: 0;
 *  Configure H264 ROI region5 qp in video B,fixed qp or delta qp.
 */
#define H264_B_ROI_REGION5_QP    0x0000007FU
#define H264_B_ROI_REGION5_QP_M  (H264_B_ROI_REGION5_QP_V << H264_B_ROI_REGION5_QP_S)
#define H264_B_ROI_REGION5_QP_V  0x0000007FU
#define H264_B_ROI_REGION5_QP_S  7
/** H264_B_ROI_REGION6_QP : R/W; bitpos: [20:14]; default: 0;
 *  Configure H264 ROI region6 qp in video B,fixed qp or delta qp.
 */
#define H264_B_ROI_REGION6_QP    0x0000007FU
#define H264_B_ROI_REGION6_QP_M  (H264_B_ROI_REGION6_QP_V << H264_B_ROI_REGION6_QP_S)
#define H264_B_ROI_REGION6_QP_V  0x0000007FU
#define H264_B_ROI_REGION6_QP_S  14
/** H264_B_ROI_REGION7_QP : R/W; bitpos: [27:21]; default: 0;
 *  Configure H264 ROI region7 qp in video B,fixed qp or delta qp.
 */
#define H264_B_ROI_REGION7_QP    0x0000007FU
#define H264_B_ROI_REGION7_QP_M  (H264_B_ROI_REGION7_QP_V << H264_B_ROI_REGION7_QP_S)
#define H264_B_ROI_REGION7_QP_V  0x0000007FU
#define H264_B_ROI_REGION7_QP_S  21

/** H264_B_NO_ROI_REGION_QP_OFFSET_REG register
 *  Video B H264 no roi region QP register.
 */
#define H264_B_NO_ROI_REGION_QP_OFFSET_REG (DR_REG_H264_BASE + 0x98)
/** H264_B_NO_ROI_REGION_QP : R/W; bitpos: [6:0]; default: 0;
 *  Configure H264 no region qp in video B, delta qp.
 */
#define H264_B_NO_ROI_REGION_QP    0x0000007FU
#define H264_B_NO_ROI_REGION_QP_M  (H264_B_NO_ROI_REGION_QP_V << H264_B_NO_ROI_REGION_QP_S)
#define H264_B_NO_ROI_REGION_QP_V  0x0000007FU
#define H264_B_NO_ROI_REGION_QP_S  0

/** H264_B_ROI_CONFIG_REG register
 *  Video B H264 ROI configure register.
 */
#define H264_B_ROI_CONFIG_REG (DR_REG_H264_BASE + 0x9c)
/** H264_B_ROI_EN : R/W; bitpos: [0]; default: 0;
 *  Configure whether or not to enable ROI in video B.\\0:not enable ROI\\1:enable ROI.
 */
#define H264_B_ROI_EN    (BIT(0))
#define H264_B_ROI_EN_M  (H264_B_ROI_EN_V << H264_B_ROI_EN_S)
#define H264_B_ROI_EN_V  0x00000001U
#define H264_B_ROI_EN_S  0
/** H264_B_ROI_MODE : R/W; bitpos: [1]; default: 0;
 *  Configure the mode of ROI in video B.\\0:fixed qp\\1:delta qp.
 */
#define H264_B_ROI_MODE    (BIT(1))
#define H264_B_ROI_MODE_M  (H264_B_ROI_MODE_V << H264_B_ROI_MODE_S)
#define H264_B_ROI_MODE_V  0x00000001U
#define H264_B_ROI_MODE_S  1

/** H264_RC_STATUS0_REG register
 *  Rate control status register0.
 */
#define H264_RC_STATUS0_REG (DR_REG_H264_BASE + 0xa0)
/** H264_FRAME_MAD_SUM : RO; bitpos: [20:0]; default: 0;
 *  Represents all MB actual MAD sum value of one frame.
 */
#define H264_FRAME_MAD_SUM    0x001FFFFFU
#define H264_FRAME_MAD_SUM_M  (H264_FRAME_MAD_SUM_V << H264_FRAME_MAD_SUM_S)
#define H264_FRAME_MAD_SUM_V  0x001FFFFFU
#define H264_FRAME_MAD_SUM_S  0

/** H264_RC_STATUS1_REG register
 *  Rate control status register1.
 */
#define H264_RC_STATUS1_REG (DR_REG_H264_BASE + 0xa4)
/** H264_FRAME_ENC_BITS : RO; bitpos: [26:0]; default: 0;
 *  Represents all MB actual encoding bits sum value of one frame.
 */
#define H264_FRAME_ENC_BITS    0x07FFFFFFU
#define H264_FRAME_ENC_BITS_M  (H264_FRAME_ENC_BITS_V << H264_FRAME_ENC_BITS_S)
#define H264_FRAME_ENC_BITS_V  0x07FFFFFFU
#define H264_FRAME_ENC_BITS_S  0

/** H264_RC_STATUS2_REG register
 *  Rate control status register2.
 */
#define H264_RC_STATUS2_REG (DR_REG_H264_BASE + 0xa8)
/** H264_FRAME_QP_SUM : RO; bitpos: [18:0]; default: 0;
 *  Represents all MB actual luma QP sum value of one frame.
 */
#define H264_FRAME_QP_SUM    0x0007FFFFU
#define H264_FRAME_QP_SUM_M  (H264_FRAME_QP_SUM_V << H264_FRAME_QP_SUM_S)
#define H264_FRAME_QP_SUM_V  0x0007FFFFU
#define H264_FRAME_QP_SUM_S  0

/** H264_SLICE_HEADER_REMAIN_REG register
 *  Frame Slice Header remain bit register.
 */
#define H264_SLICE_HEADER_REMAIN_REG (DR_REG_H264_BASE + 0xac)
/** H264_SLICE_REMAIN_BITLENGTH : R/W; bitpos: [2:0]; default: 0;
 *  Configures Slice Header remain bit number
 */
#define H264_SLICE_REMAIN_BITLENGTH    0x00000007U
#define H264_SLICE_REMAIN_BITLENGTH_M  (H264_SLICE_REMAIN_BITLENGTH_V << H264_SLICE_REMAIN_BITLENGTH_S)
#define H264_SLICE_REMAIN_BITLENGTH_V  0x00000007U
#define H264_SLICE_REMAIN_BITLENGTH_S  0
/** H264_SLICE_REMAIN_BIT : R/W; bitpos: [10:3]; default: 0;
 *  Configures Slice Header remain bit
 */
#define H264_SLICE_REMAIN_BIT    0x000000FFU
#define H264_SLICE_REMAIN_BIT_M  (H264_SLICE_REMAIN_BIT_V << H264_SLICE_REMAIN_BIT_S)
#define H264_SLICE_REMAIN_BIT_V  0x000000FFU
#define H264_SLICE_REMAIN_BIT_S  3

/** H264_SLICE_HEADER_BYTE_LENGTH_REG register
 *  Frame Slice Header byte length register.
 */
#define H264_SLICE_HEADER_BYTE_LENGTH_REG (DR_REG_H264_BASE + 0xb0)
/** H264_SLICE_BYTE_LENGTH : R/W; bitpos: [3:0]; default: 0;
 *  Configures Slice Header byte number
 */
#define H264_SLICE_BYTE_LENGTH    0x0000000FU
#define H264_SLICE_BYTE_LENGTH_M  (H264_SLICE_BYTE_LENGTH_V << H264_SLICE_BYTE_LENGTH_S)
#define H264_SLICE_BYTE_LENGTH_V  0x0000000FU
#define H264_SLICE_BYTE_LENGTH_S  0

/** H264_BS_THRESHOLD_REG register
 *  Bitstream buffer overflow threshold register
 */
#define H264_BS_THRESHOLD_REG (DR_REG_H264_BASE + 0xb4)
/** H264_BS_BUFFER_THRESHOLD : R/W; bitpos: [6:0]; default: 48;
 *  Configures bitstream buffer overflow threshold. This value should be bigger than
 *  the encode bytes of one 4x4 submb.
 */
#define H264_BS_BUFFER_THRESHOLD    0x0000007FU
#define H264_BS_BUFFER_THRESHOLD_M  (H264_BS_BUFFER_THRESHOLD_V << H264_BS_BUFFER_THRESHOLD_S)
#define H264_BS_BUFFER_THRESHOLD_V  0x0000007FU
#define H264_BS_BUFFER_THRESHOLD_S  0

/** H264_SLICE_HEADER_BYTE0_REG register
 *  Frame Slice Header byte low 32 bit  register.
 */
#define H264_SLICE_HEADER_BYTE0_REG (DR_REG_H264_BASE + 0xb8)
/** H264_SLICE_BYTE_LSB : R/W; bitpos: [31:0]; default: 0;
 *  Configures Slice Header low 32 bit
 */
#define H264_SLICE_BYTE_LSB    0xFFFFFFFFU
#define H264_SLICE_BYTE_LSB_M  (H264_SLICE_BYTE_LSB_V << H264_SLICE_BYTE_LSB_S)
#define H264_SLICE_BYTE_LSB_V  0xFFFFFFFFU
#define H264_SLICE_BYTE_LSB_S  0

