espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_reg.h
/** H264_SLICE_HEADER_BYTE1_REG register
 *  Frame Slice Header byte high 32 bit  register.
 */
#define H264_SLICE_HEADER_BYTE1_REG (DR_REG_H264_BASE + 0xbc)
/** H264_SLICE_BYTE_MSB : R/W; bitpos: [31:0]; default: 0;
 *  Configures Slice Header high 32 bit
 */
#define H264_SLICE_BYTE_MSB    0xFFFFFFFFU
#define H264_SLICE_BYTE_MSB_M  (H264_SLICE_BYTE_MSB_V << H264_SLICE_BYTE_MSB_S)
#define H264_SLICE_BYTE_MSB_V  0xFFFFFFFFU
#define H264_SLICE_BYTE_MSB_S  0

/** H264_INT_RAW_REG register
 *  Interrupt raw status register
 */
#define H264_INT_RAW_REG (DR_REG_H264_BASE + 0xc0)
/** H264_DB_TMP_READY_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  Raw status bit: The raw interrupt status of  H264_DB_TMP_READY_INT. Triggered when
 *  H264 written enough db tmp pixel.
 */
#define H264_DB_TMP_READY_INT_RAW    (BIT(0))
#define H264_DB_TMP_READY_INT_RAW_M  (H264_DB_TMP_READY_INT_RAW_V << H264_DB_TMP_READY_INT_RAW_S)
#define H264_DB_TMP_READY_INT_RAW_V  0x00000001U
#define H264_DB_TMP_READY_INT_RAW_S  0
/** H264_REC_READY_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  Raw status bit: The raw interrupt status of  H264_REC_READY_INT. Triggered when
 *  H264 encoding enough reconstruct pixel.
 */
#define H264_REC_READY_INT_RAW    (BIT(1))
#define H264_REC_READY_INT_RAW_M  (H264_REC_READY_INT_RAW_V << H264_REC_READY_INT_RAW_S)
#define H264_REC_READY_INT_RAW_V  0x00000001U
#define H264_REC_READY_INT_RAW_S  1
/** H264_FRAME_DONE_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  Raw status bit: The raw interrupt status of  H264_FRAME_DONE_INT. Triggered when
 *  H264 encoding one frame done.
 */
#define H264_FRAME_DONE_INT_RAW    (BIT(2))
#define H264_FRAME_DONE_INT_RAW_M  (H264_FRAME_DONE_INT_RAW_V << H264_FRAME_DONE_INT_RAW_S)
#define H264_FRAME_DONE_INT_RAW_V  0x00000001U
#define H264_FRAME_DONE_INT_RAW_S  2
/** H264_DMA_MOVE_2MB_LINE_DONE_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  Raw status bit: The raw interrupt status of H264_DMA_MOVE_2MB_LINE_DONE_INT.
 *  Triggered when H264 move two MB lines of reference frame from external mem to
 *  internal mem done.
 */
#define H264_DMA_MOVE_2MB_LINE_DONE_INT_RAW    (BIT(3))
#define H264_DMA_MOVE_2MB_LINE_DONE_INT_RAW_M  (H264_DMA_MOVE_2MB_LINE_DONE_INT_RAW_V << H264_DMA_MOVE_2MB_LINE_DONE_INT_RAW_S)
#define H264_DMA_MOVE_2MB_LINE_DONE_INT_RAW_V  0x00000001U
#define H264_DMA_MOVE_2MB_LINE_DONE_INT_RAW_S  3

/** H264_INT_ST_REG register
 *  Interrupt masked status register
 */
#define H264_INT_ST_REG (DR_REG_H264_BASE + 0xc4)
/** H264_DB_TMP_READY_INT_ST : RO; bitpos: [0]; default: 0;
 *  The masked interrupt status of H264_DB_TMP_READY_INT. Valid only when the
 *  H264_DB_TMP_READY_INT_ENA is set to 1.
 */
#define H264_DB_TMP_READY_INT_ST    (BIT(0))
#define H264_DB_TMP_READY_INT_ST_M  (H264_DB_TMP_READY_INT_ST_V << H264_DB_TMP_READY_INT_ST_S)
#define H264_DB_TMP_READY_INT_ST_V  0x00000001U
#define H264_DB_TMP_READY_INT_ST_S  0
/** H264_REC_READY_INT_ST : RO; bitpos: [1]; default: 0;
 *  The masked interrupt status of H264_REC_READY_INT. Valid only when the
 *  H264_REC_READY_INT_ENA is set to 1.
 */
#define H264_REC_READY_INT_ST    (BIT(1))
#define H264_REC_READY_INT_ST_M  (H264_REC_READY_INT_ST_V << H264_REC_READY_INT_ST_S)
#define H264_REC_READY_INT_ST_V  0x00000001U
#define H264_REC_READY_INT_ST_S  1
/** H264_FRAME_DONE_INT_ST : RO; bitpos: [2]; default: 0;
 *  The masked interrupt status of H264_FRAME_DONE_INT. Valid only when the
 *  H264_FRAME_DONE_INT_ENA is set to 1.
 */
#define H264_FRAME_DONE_INT_ST    (BIT(2))
#define H264_FRAME_DONE_INT_ST_M  (H264_FRAME_DONE_INT_ST_V << H264_FRAME_DONE_INT_ST_S)
#define H264_FRAME_DONE_INT_ST_V  0x00000001U
#define H264_FRAME_DONE_INT_ST_S  2
/** H264_DMA_MOVE_2MB_LINE_DONE_INT_ST : RO; bitpos: [3]; default: 0;
 *  Masked status bit: The masked interrupt status of H264_DMA_MOVE_2MB_LINE_DONE_INT.
 *  Valid only when the H264_DMA_MOVE_2MB_LINE_DONE_INT_ENA is set to 1.
 */
#define H264_DMA_MOVE_2MB_LINE_DONE_INT_ST    (BIT(3))
#define H264_DMA_MOVE_2MB_LINE_DONE_INT_ST_M  (H264_DMA_MOVE_2MB_LINE_DONE_INT_ST_V << H264_DMA_MOVE_2MB_LINE_DONE_INT_ST_S)
#define H264_DMA_MOVE_2MB_LINE_DONE_INT_ST_V  0x00000001U
#define H264_DMA_MOVE_2MB_LINE_DONE_INT_ST_S  3

/** H264_INT_ENA_REG register
 *  Interrupt enable register
 */
#define H264_INT_ENA_REG (DR_REG_H264_BASE + 0xc8)
/** H264_DB_TMP_READY_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  Write 1 to enable H264_DB_TMP_READY_INT.
 */
#define H264_DB_TMP_READY_INT_ENA    (BIT(0))
#define H264_DB_TMP_READY_INT_ENA_M  (H264_DB_TMP_READY_INT_ENA_V << H264_DB_TMP_READY_INT_ENA_S)
#define H264_DB_TMP_READY_INT_ENA_V  0x00000001U
#define H264_DB_TMP_READY_INT_ENA_S  0
/** H264_REC_READY_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  Write 1 to enable H264_REC_READY_INT.
 */
#define H264_REC_READY_INT_ENA    (BIT(1))
#define H264_REC_READY_INT_ENA_M  (H264_REC_READY_INT_ENA_V << H264_REC_READY_INT_ENA_S)
#define H264_REC_READY_INT_ENA_V  0x00000001U
#define H264_REC_READY_INT_ENA_S  1
/** H264_FRAME_DONE_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  Write 1 to enable H264_FRAME_DONE_INT.
 */
#define H264_FRAME_DONE_INT_ENA    (BIT(2))
#define H264_FRAME_DONE_INT_ENA_M  (H264_FRAME_DONE_INT_ENA_V << H264_FRAME_DONE_INT_ENA_S)
#define H264_FRAME_DONE_INT_ENA_V  0x00000001U
#define H264_FRAME_DONE_INT_ENA_S  2
/** H264_DMA_MOVE_2MB_LINE_DONE_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  Enable bit: Write 1 to enable H264_DMA_MOVE_2MB_LINE_DONE_INT.
 */
#define H264_DMA_MOVE_2MB_LINE_DONE_INT_ENA    (BIT(3))
#define H264_DMA_MOVE_2MB_LINE_DONE_INT_ENA_M  (H264_DMA_MOVE_2MB_LINE_DONE_INT_ENA_V << H264_DMA_MOVE_2MB_LINE_DONE_INT_ENA_S)
#define H264_DMA_MOVE_2MB_LINE_DONE_INT_ENA_V  0x00000001U
#define H264_DMA_MOVE_2MB_LINE_DONE_INT_ENA_S  3

/** H264_INT_CLR_REG register
 *  Interrupt clear register
 */
#define H264_INT_CLR_REG (DR_REG_H264_BASE + 0xcc)
/** H264_DB_TMP_READY_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Write 1 to clear H264_DB_TMP_READY_INT.
 */
#define H264_DB_TMP_READY_INT_CLR    (BIT(0))
#define H264_DB_TMP_READY_INT_CLR_M  (H264_DB_TMP_READY_INT_CLR_V << H264_DB_TMP_READY_INT_CLR_S)
#define H264_DB_TMP_READY_INT_CLR_V  0x00000001U
#define H264_DB_TMP_READY_INT_CLR_S  0
/** H264_REC_READY_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Write 1 to clear H264_REC_READY_INT.
 */
#define H264_REC_READY_INT_CLR    (BIT(1))
#define H264_REC_READY_INT_CLR_M  (H264_REC_READY_INT_CLR_V << H264_REC_READY_INT_CLR_S)
#define H264_REC_READY_INT_CLR_V  0x00000001U
#define H264_REC_READY_INT_CLR_S  1
/** H264_FRAME_DONE_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Write 1 to clear H264_FRAME_DONE_INT.
 */
#define H264_FRAME_DONE_INT_CLR    (BIT(2))
#define H264_FRAME_DONE_INT_CLR_M  (H264_FRAME_DONE_INT_CLR_V << H264_FRAME_DONE_INT_CLR_S)
#define H264_FRAME_DONE_INT_CLR_V  0x00000001U
#define H264_FRAME_DONE_INT_CLR_S  2
/** H264_DMA_MOVE_2MB_LINE_DONE_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Clear bit: Write 1 to clear H264_DMA_MOVE_2MB_LINE_DONE_INT.
 */
#define H264_DMA_MOVE_2MB_LINE_DONE_INT_CLR    (BIT(3))
#define H264_DMA_MOVE_2MB_LINE_DONE_INT_CLR_M  (H264_DMA_MOVE_2MB_LINE_DONE_INT_CLR_V << H264_DMA_MOVE_2MB_LINE_DONE_INT_CLR_S)
#define H264_DMA_MOVE_2MB_LINE_DONE_INT_CLR_V  0x00000001U
#define H264_DMA_MOVE_2MB_LINE_DONE_INT_CLR_S  3

/** H264_CONF_REG register
 *  General configuration register.
 */
#define H264_CONF_REG (DR_REG_H264_BASE + 0xd0)
/** H264_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether or not to open register clock gate.\\0: Open the clock gate only
 *  when application writes registers\\1: Force open the clock gate for register
 */
#define H264_CLK_EN    (BIT(0))
#define H264_CLK_EN_M  (H264_CLK_EN_V << H264_CLK_EN_S)
#define H264_CLK_EN_V  0x00000001U
#define H264_CLK_EN_S  0
/** H264_REC_RAM_CLK_EN2 : R/W; bitpos: [1]; default: 0;
 *  Configures whether or not to open the clock gate for rec ram2.\\0: Open the clock
 *  gate only when application writes or reads rec ram2\\1: Force open the clock gate
 *  for rec ram2
 */
#define H264_REC_RAM_CLK_EN2    (BIT(1))
#define H264_REC_RAM_CLK_EN2_M  (H264_REC_RAM_CLK_EN2_V << H264_REC_RAM_CLK_EN2_S)
#define H264_REC_RAM_CLK_EN2_V  0x00000001U
#define H264_REC_RAM_CLK_EN2_S  1
/** H264_REC_RAM_CLK_EN1 : R/W; bitpos: [2]; default: 0;
 *  Configures whether or not to open the clock gate for rec ram1.\\0: Open the clock
 *  gate only when application writes or reads rec ram1\\1: Force open the clock gate
 *  for rec ram1
 */
#define H264_REC_RAM_CLK_EN1    (BIT(2))
#define H264_REC_RAM_CLK_EN1_M  (H264_REC_RAM_CLK_EN1_V << H264_REC_RAM_CLK_EN1_S)
#define H264_REC_RAM_CLK_EN1_V  0x00000001U
#define H264_REC_RAM_CLK_EN1_S  2
/** H264_QUANT_RAM_CLK_EN2 : R/W; bitpos: [3]; default: 0;
 *  Configures whether or not to open the clock gate for quant ram2.\\0: Open the clock
 *  gate only when application writes or reads quant ram2\\1: Force open the clock gate
 *  for quant ram2
 */
#define H264_QUANT_RAM_CLK_EN2    (BIT(3))
#define H264_QUANT_RAM_CLK_EN2_M  (H264_QUANT_RAM_CLK_EN2_V << H264_QUANT_RAM_CLK_EN2_S)
#define H264_QUANT_RAM_CLK_EN2_V  0x00000001U
#define H264_QUANT_RAM_CLK_EN2_S  3
/** H264_QUANT_RAM_CLK_EN1 : R/W; bitpos: [4]; default: 0;
 *  Configures whether or not to open the clock gate for quant ram1.\\0: Open the clock
 *  gate only when application writes or reads quant ram1\\1: Force open the clock gate
 *  for quant ram1
 */
#define H264_QUANT_RAM_CLK_EN1    (BIT(4))
#define H264_QUANT_RAM_CLK_EN1_M  (H264_QUANT_RAM_CLK_EN1_V << H264_QUANT_RAM_CLK_EN1_S)
#define H264_QUANT_RAM_CLK_EN1_V  0x00000001U
#define H264_QUANT_RAM_CLK_EN1_S  4
/** H264_PRE_RAM_CLK_EN : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to open the clock gate for pre ram.\\0: Open the clock
 *  gate only when application writes or reads pre ram\\1: Force open the clock gate
 *  for pre ram
 */
#define H264_PRE_RAM_CLK_EN    (BIT(5))
#define H264_PRE_RAM_CLK_EN_M  (H264_PRE_RAM_CLK_EN_V << H264_PRE_RAM_CLK_EN_S)
#define H264_PRE_RAM_CLK_EN_V  0x00000001U
#define H264_PRE_RAM_CLK_EN_S  5
/** H264_MVD_RAM_CLK_EN : R/W; bitpos: [6]; default: 0;
 *  Configures whether or not to open the clock gate for mvd ram.\\0: Open the clock
 *  gate only when application writes or reads mvd ram\\1: Force open the clock gate
 *  for mvd ram
 */
#define H264_MVD_RAM_CLK_EN    (BIT(6))
#define H264_MVD_RAM_CLK_EN_M  (H264_MVD_RAM_CLK_EN_V << H264_MVD_RAM_CLK_EN_S)
#define H264_MVD_RAM_CLK_EN_V  0x00000001U
#define H264_MVD_RAM_CLK_EN_S  6
/** H264_MC_RAM_CLK_EN : R/W; bitpos: [7]; default: 0;
 *  Configures whether or not to open the clock gate for mc ram.\\0: Open the clock
 *  gate only when application writes or reads mc ram\\1: Force open the clock gate for
 *  mc ram
 */
#define H264_MC_RAM_CLK_EN    (BIT(7))
#define H264_MC_RAM_CLK_EN_M  (H264_MC_RAM_CLK_EN_V << H264_MC_RAM_CLK_EN_S)
#define H264_MC_RAM_CLK_EN_V  0x00000001U
#define H264_MC_RAM_CLK_EN_S  7
/** H264_REF_RAM_CLK_EN : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to open the clock gate for ref ram.\\0: Open the clock
 *  gate only when application writes or reads ref ram\\1: Force open the clock gate
 *  for ref ram
 */
#define H264_REF_RAM_CLK_EN    (BIT(8))
#define H264_REF_RAM_CLK_EN_M  (H264_REF_RAM_CLK_EN_V << H264_REF_RAM_CLK_EN_S)
#define H264_REF_RAM_CLK_EN_V  0x00000001U
#define H264_REF_RAM_CLK_EN_S  8
/** H264_I4X4_REF_RAM_CLK_EN : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to open the clock gate for i4x4_mode ram.\\0: Open the
 *  clock gate only when application writes or reads i4x4_mode ram\\1: Force open the
 *  clock gate for i4x4_mode ram
 */
#define H264_I4X4_REF_RAM_CLK_EN    (BIT(9))
#define H264_I4X4_REF_RAM_CLK_EN_M  (H264_I4X4_REF_RAM_CLK_EN_V << H264_I4X4_REF_RAM_CLK_EN_S)
#define H264_I4X4_REF_RAM_CLK_EN_V  0x00000001U
#define H264_I4X4_REF_RAM_CLK_EN_S  9
/** H264_IME_RAM_CLK_EN : R/W; bitpos: [10]; default: 0;
 *  Configures whether or not to open the clock gate for ime ram.\\0: Open the clock
 *  gate only when application writes or reads ime ram\\1: Force open the clock gate
 *  for ime ram
 */
#define H264_IME_RAM_CLK_EN    (BIT(10))
#define H264_IME_RAM_CLK_EN_M  (H264_IME_RAM_CLK_EN_V << H264_IME_RAM_CLK_EN_S)
#define H264_IME_RAM_CLK_EN_V  0x00000001U
#define H264_IME_RAM_CLK_EN_S  10
/** H264_FME_RAM_CLK_EN : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to open the clock gate for fme ram.\\0: Open the clock
 *  gate only when application writes or readsfme ram\\1: Force open the clock gate for
 *  fme ram
 */
#define H264_FME_RAM_CLK_EN    (BIT(11))
#define H264_FME_RAM_CLK_EN_M  (H264_FME_RAM_CLK_EN_V << H264_FME_RAM_CLK_EN_S)
#define H264_FME_RAM_CLK_EN_V  0x00000001U
#define H264_FME_RAM_CLK_EN_S  11
/** H264_FETCH_RAM_CLK_EN : R/W; bitpos: [12]; default: 0;
 *  Configures whether or not to open the clock gate for fetch ram.\\0: Open the clock
 *  gate only when application writes or reads fetch ram\\1: Force open the clock gate
 *  for fetch ram
 */
#define H264_FETCH_RAM_CLK_EN    (BIT(12))
#define H264_FETCH_RAM_CLK_EN_M  (H264_FETCH_RAM_CLK_EN_V << H264_FETCH_RAM_CLK_EN_S)
#define H264_FETCH_RAM_CLK_EN_V  0x00000001U
#define H264_FETCH_RAM_CLK_EN_S  12
/** H264_DB_RAM_CLK_EN : R/W; bitpos: [13]; default: 0;
 *  Configures whether or not to open the clock gate for db ram.\\0: Open the clock
 *  gate only when application writes or reads db ram\\1: Force open the clock gate for
 *  db ram
 */
#define H264_DB_RAM_CLK_EN    (BIT(13))
#define H264_DB_RAM_CLK_EN_M  (H264_DB_RAM_CLK_EN_V << H264_DB_RAM_CLK_EN_S)
#define H264_DB_RAM_CLK_EN_V  0x00000001U
#define H264_DB_RAM_CLK_EN_S  13
/** H264_CUR_MB_RAM_CLK_EN : R/W; bitpos: [14]; default: 0;
 *  Configures whether or not to open the clock gate for cur_mb ram.\\0: Open the clock
 *  gate only when application writes or reads cur_mb ram\\1: Force open the clock gate
 *  for cur_mb ram
 */
#define H264_CUR_MB_RAM_CLK_EN    (BIT(14))
#define H264_CUR_MB_RAM_CLK_EN_M  (H264_CUR_MB_RAM_CLK_EN_V << H264_CUR_MB_RAM_CLK_EN_S)
#define H264_CUR_MB_RAM_CLK_EN_V  0x00000001U
#define H264_CUR_MB_RAM_CLK_EN_S  14
/** H264_CAVLC_RAM_CLK_EN : R/W; bitpos: [15]; default: 0;
 *  Configures whether or not to open the clock gate for cavlc ram.\\0: Open the clock
 *  gate only when application writes or reads cavlc ram\\1: Force open the clock gate
 *  for cavlc ram
 */
#define H264_CAVLC_RAM_CLK_EN    (BIT(15))
#define H264_CAVLC_RAM_CLK_EN_M  (H264_CAVLC_RAM_CLK_EN_V << H264_CAVLC_RAM_CLK_EN_S)
#define H264_CAVLC_RAM_CLK_EN_V  0x00000001U
#define H264_CAVLC_RAM_CLK_EN_S  15
/** H264_IME_CLK_EN : R/W; bitpos: [16]; default: 0;
 *  Configures whether or not to open the clock gate for ime.\\0: Open the clock gate
 *  only when ime work\\1: Force open the clock gate for ime
 */
#define H264_IME_CLK_EN    (BIT(16))
#define H264_IME_CLK_EN_M  (H264_IME_CLK_EN_V << H264_IME_CLK_EN_S)
#define H264_IME_CLK_EN_V  0x00000001U
#define H264_IME_CLK_EN_S  16
/** H264_FME_CLK_EN : R/W; bitpos: [17]; default: 0;
 *  Configures whether or not to open the clock gate for fme.\\0: Open the clock gate
 *  only when fme work\\1: Force open the clock gate for fme
 */
#define H264_FME_CLK_EN    (BIT(17))
#define H264_FME_CLK_EN_M  (H264_FME_CLK_EN_V << H264_FME_CLK_EN_S)
#define H264_FME_CLK_EN_V  0x00000001U
#define H264_FME_CLK_EN_S  17
/** H264_MC_CLK_EN : R/W; bitpos: [18]; default: 0;
 *  Configures whether or not to open the clock gate for mc.\\0: Open the clock gate
 *  only when mc work\\1: Force open the clock gate for mc
 */
#define H264_MC_CLK_EN    (BIT(18))
#define H264_MC_CLK_EN_M  (H264_MC_CLK_EN_V << H264_MC_CLK_EN_S)
#define H264_MC_CLK_EN_V  0x00000001U
#define H264_MC_CLK_EN_S  18
/** H264_INTERPOLATOR_CLK_EN : R/W; bitpos: [19]; default: 0;
 *  Configures whether or not to open the clock gate for interpolator.\\0: Open the
 *  clock gate only when interpolator work\\1: Force open the clock gate for
 *  interpolator
 */
#define H264_INTERPOLATOR_CLK_EN    (BIT(19))
#define H264_INTERPOLATOR_CLK_EN_M  (H264_INTERPOLATOR_CLK_EN_V << H264_INTERPOLATOR_CLK_EN_S)
#define H264_INTERPOLATOR_CLK_EN_V  0x00000001U
#define H264_INTERPOLATOR_CLK_EN_S  19
/** H264_DB_CLK_EN : R/W; bitpos: [20]; default: 0;
 *  Configures whether or not to open the clock gate for deblocking filter.\\0: Open
 *  the clock gate only when deblocking filter work\\1: Force open the clock gate for
 *  deblocking filter
 */
#define H264_DB_CLK_EN    (BIT(20))
#define H264_DB_CLK_EN_M  (H264_DB_CLK_EN_V << H264_DB_CLK_EN_S)
#define H264_DB_CLK_EN_V  0x00000001U
#define H264_DB_CLK_EN_S  20
/** H264_CLAVLC_CLK_EN : R/W; bitpos: [21]; default: 0;
 *  Configures whether or not to open the clock gate for cavlc.\\0: Open the clock gate
 *  only when cavlc work\\1: Force open the clock gate for cavlc
 */
#define H264_CLAVLC_CLK_EN    (BIT(21))
#define H264_CLAVLC_CLK_EN_M  (H264_CLAVLC_CLK_EN_V << H264_CLAVLC_CLK_EN_S)
#define H264_CLAVLC_CLK_EN_V  0x00000001U
#define H264_CLAVLC_CLK_EN_S  21
/** H264_INTRA_CLK_EN : R/W; bitpos: [22]; default: 0;
 *  Configures whether or not to open the clock gate for intra.\\0: Open the clock gate
 *  only when intra work\\1: Force open the clock gate for intra
 */
#define H264_INTRA_CLK_EN    (BIT(22))
#define H264_INTRA_CLK_EN_M  (H264_INTRA_CLK_EN_V << H264_INTRA_CLK_EN_S)
#define H264_INTRA_CLK_EN_V  0x00000001U
#define H264_INTRA_CLK_EN_S  22
/** H264_DECI_CLK_EN : R/W; bitpos: [23]; default: 0;
 *  Configures whether or not to open the clock gate for decimate.\\0: Open the clock
 *  gate only when decimate work\\1: Force open the clock gate for decimate
 */
#define H264_DECI_CLK_EN    (BIT(23))
#define H264_DECI_CLK_EN_M  (H264_DECI_CLK_EN_V << H264_DECI_CLK_EN_S)
#define H264_DECI_CLK_EN_V  0x00000001U
#define H264_DECI_CLK_EN_S  23
/** H264_BS_CLK_EN : R/W; bitpos: [24]; default: 0;
 *  Configures whether or not to open the clock gate for bs buffer.\\0: Open the clock
 *  gate only when bs buffer work\\1: Force open the clock gate for bs buffer
 */
#define H264_BS_CLK_EN    (BIT(24))
#define H264_BS_CLK_EN_M  (H264_BS_CLK_EN_V << H264_BS_CLK_EN_S)
#define H264_BS_CLK_EN_V  0x00000001U
#define H264_BS_CLK_EN_S  24
/** H264_MV_MERGE_CLK_EN : R/W; bitpos: [25]; default: 0;
 *  Configures whether or not to open the clock gate for mv merge.\\0: Open the clock
 *  gate only when mv merge work\\1: Force open the clock gate for mv merge
 */
#define H264_MV_MERGE_CLK_EN    (BIT(25))
#define H264_MV_MERGE_CLK_EN_M  (H264_MV_MERGE_CLK_EN_V << H264_MV_MERGE_CLK_EN_S)
#define H264_MV_MERGE_CLK_EN_V  0x00000001U
#define H264_MV_MERGE_CLK_EN_S  25

