espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_reg.h
/** H264_MV_MERGE_CONFIG_REG register
 *  Mv merge configuration register.
 */
#define H264_MV_MERGE_CONFIG_REG (DR_REG_H264_BASE + 0xd4)
/** H264_MV_MERGE_TYPE : R/W; bitpos: [1:0]; default: 0;
 *  Configure mv merge type.\\0: merge p16x16 mv\\1: merge min mv\\2: merge max mv\\3:
 *  not valid.
 */
#define H264_MV_MERGE_TYPE    0x00000003U
#define H264_MV_MERGE_TYPE_M  (H264_MV_MERGE_TYPE_V << H264_MV_MERGE_TYPE_S)
#define H264_MV_MERGE_TYPE_V  0x00000003U
#define H264_MV_MERGE_TYPE_S  0
/** H264_INT_MV_OUT_EN : R/W; bitpos: [2]; default: 0;
 *  Configure mv merge output integer part not zero mv or all part not zero mv.\\0:
 *  output all part not zero mv\\1: output integer part not zero mv.
 */
#define H264_INT_MV_OUT_EN    (BIT(2))
#define H264_INT_MV_OUT_EN_M  (H264_INT_MV_OUT_EN_V << H264_INT_MV_OUT_EN_S)
#define H264_INT_MV_OUT_EN_V  0x00000001U
#define H264_INT_MV_OUT_EN_S  2
/** H264_A_MV_MERGE_EN : R/W; bitpos: [3]; default: 0;
 *  Configure whether or not to enable video A mv merge.\\0: disable\\1: enable.
 */
#define H264_A_MV_MERGE_EN    (BIT(3))
#define H264_A_MV_MERGE_EN_M  (H264_A_MV_MERGE_EN_V << H264_A_MV_MERGE_EN_S)
#define H264_A_MV_MERGE_EN_V  0x00000001U
#define H264_A_MV_MERGE_EN_S  3
/** H264_B_MV_MERGE_EN : R/W; bitpos: [4]; default: 0;
 *  Configure whether or not to enable video B mv merge.\\0: disable\\1: enable.
 */
#define H264_B_MV_MERGE_EN    (BIT(4))
#define H264_B_MV_MERGE_EN_M  (H264_B_MV_MERGE_EN_V << H264_B_MV_MERGE_EN_S)
#define H264_B_MV_MERGE_EN_V  0x00000001U
#define H264_B_MV_MERGE_EN_S  4
/** H264_MB_VALID_NUM : RO; bitpos: [17:5]; default: 0;
 *  Represents the valid mb number of mv merge output.
 */
#define H264_MB_VALID_NUM    0x00001FFFU
#define H264_MB_VALID_NUM_M  (H264_MB_VALID_NUM_V << H264_MB_VALID_NUM_S)
#define H264_MB_VALID_NUM_V  0x00001FFFU
#define H264_MB_VALID_NUM_S  5

/** H264_DEBUG_DMA_SEL_REG register
 *  Debug H264 DMA select register
 */
#define H264_DEBUG_DMA_SEL_REG (DR_REG_H264_BASE + 0xd8)
/** H264_DBG_DMA_SEL : R/W; bitpos: [7:0]; default: 0;
 *  Every bit represents a dma in h264
 */
#define H264_DBG_DMA_SEL    0x000000FFU
#define H264_DBG_DMA_SEL_M  (H264_DBG_DMA_SEL_V << H264_DBG_DMA_SEL_S)
#define H264_DBG_DMA_SEL_V  0x000000FFU
#define H264_DBG_DMA_SEL_S  0

/** H264_SYS_STATUS_REG register
 *  System status register.
 */
#define H264_SYS_STATUS_REG (DR_REG_H264_BASE + 0xdc)
/** H264_FRAME_NUM : RO; bitpos: [8:0]; default: 0;
 *  Represents current frame number.
 */
#define H264_FRAME_NUM    0x000001FFU
#define H264_FRAME_NUM_M  (H264_FRAME_NUM_V << H264_FRAME_NUM_S)
#define H264_FRAME_NUM_V  0x000001FFU
#define H264_FRAME_NUM_S  0
/** H264_DUAL_STREAM_SEL : RO; bitpos: [9]; default: 0;
 *  Represents which register group is used for cur frame.\\0: Register group A is
 *  used\\1: Register group B is used.
 */
#define H264_DUAL_STREAM_SEL    (BIT(9))
#define H264_DUAL_STREAM_SEL_M  (H264_DUAL_STREAM_SEL_V << H264_DUAL_STREAM_SEL_S)
#define H264_DUAL_STREAM_SEL_V  0x00000001U
#define H264_DUAL_STREAM_SEL_S  9
/** H264_INTRA_FLAG : RO; bitpos: [10]; default: 0;
 *  Represents the type of current encoding frame.\\0: P frame\\1: I frame.
 */
#define H264_INTRA_FLAG    (BIT(10))
#define H264_INTRA_FLAG_M  (H264_INTRA_FLAG_V << H264_INTRA_FLAG_S)
#define H264_INTRA_FLAG_V  0x00000001U
#define H264_INTRA_FLAG_S  10

/** H264_FRAME_CODE_LENGTH_REG register
 *  Frame code byte length register.
 */
#define H264_FRAME_CODE_LENGTH_REG (DR_REG_H264_BASE + 0xe0)
/** H264_FRAME_CODE_LENGTH : RO; bitpos: [23:0]; default: 0;
 *  Represents current frame code byte length.
 */
#define H264_FRAME_CODE_LENGTH    0x00FFFFFFU
#define H264_FRAME_CODE_LENGTH_M  (H264_FRAME_CODE_LENGTH_V << H264_FRAME_CODE_LENGTH_S)
#define H264_FRAME_CODE_LENGTH_V  0x00FFFFFFU
#define H264_FRAME_CODE_LENGTH_S  0

/** H264_DEBUG_INFO0_REG register
 *  Debug information register0.
 */
#define H264_DEBUG_INFO0_REG (DR_REG_H264_BASE + 0xe4)
/** H264_TOP_CTRL_INTER_DEBUG_STATE : RO; bitpos: [3:0]; default: 0;
 *  Represents top_ctrl_inter module FSM info.
 */
#define H264_TOP_CTRL_INTER_DEBUG_STATE    0x0000000FU
#define H264_TOP_CTRL_INTER_DEBUG_STATE_M  (H264_TOP_CTRL_INTER_DEBUG_STATE_V << H264_TOP_CTRL_INTER_DEBUG_STATE_S)
#define H264_TOP_CTRL_INTER_DEBUG_STATE_V  0x0000000FU
#define H264_TOP_CTRL_INTER_DEBUG_STATE_S  0
/** H264_TOP_CTRL_INTRA_DEBUG_STATE : RO; bitpos: [6:4]; default: 0;
 *  Represents top_ctrl_intra module FSM info.
 */
#define H264_TOP_CTRL_INTRA_DEBUG_STATE    0x00000007U
#define H264_TOP_CTRL_INTRA_DEBUG_STATE_M  (H264_TOP_CTRL_INTRA_DEBUG_STATE_V << H264_TOP_CTRL_INTRA_DEBUG_STATE_S)
#define H264_TOP_CTRL_INTRA_DEBUG_STATE_V  0x00000007U
#define H264_TOP_CTRL_INTRA_DEBUG_STATE_S  4
/** H264_P_I_CMP_DEBUG_STATE : RO; bitpos: [9:7]; default: 0;
 *  Represents p_i_cmp module FSM info.
 */
#define H264_P_I_CMP_DEBUG_STATE    0x00000007U
#define H264_P_I_CMP_DEBUG_STATE_M  (H264_P_I_CMP_DEBUG_STATE_V << H264_P_I_CMP_DEBUG_STATE_S)
#define H264_P_I_CMP_DEBUG_STATE_V  0x00000007U
#define H264_P_I_CMP_DEBUG_STATE_S  7
/** H264_MVD_DEBUG_STATE : RO; bitpos: [12:10]; default: 0;
 *  Represents mvd module FSM info.
 */
#define H264_MVD_DEBUG_STATE    0x00000007U
#define H264_MVD_DEBUG_STATE_M  (H264_MVD_DEBUG_STATE_V << H264_MVD_DEBUG_STATE_S)
#define H264_MVD_DEBUG_STATE_V  0x00000007U
#define H264_MVD_DEBUG_STATE_S  10
/** H264_MC_CHROMA_IP_DEBUG_STATE : RO; bitpos: [13]; default: 0;
 *  Represents mc_chroma_ip module FSM info.
 */
#define H264_MC_CHROMA_IP_DEBUG_STATE    (BIT(13))
#define H264_MC_CHROMA_IP_DEBUG_STATE_M  (H264_MC_CHROMA_IP_DEBUG_STATE_V << H264_MC_CHROMA_IP_DEBUG_STATE_S)
#define H264_MC_CHROMA_IP_DEBUG_STATE_V  0x00000001U
#define H264_MC_CHROMA_IP_DEBUG_STATE_S  13
/** H264_INTRA_16X16_CHROMA_CTRL_DEBUG_STATE : RO; bitpos: [17:14]; default: 0;
 *  Represents intra_16x16_chroma_ctrl module FSM info.
 */
#define H264_INTRA_16X16_CHROMA_CTRL_DEBUG_STATE    0x0000000FU
#define H264_INTRA_16X16_CHROMA_CTRL_DEBUG_STATE_M  (H264_INTRA_16X16_CHROMA_CTRL_DEBUG_STATE_V << H264_INTRA_16X16_CHROMA_CTRL_DEBUG_STATE_S)
#define H264_INTRA_16X16_CHROMA_CTRL_DEBUG_STATE_V  0x0000000FU
#define H264_INTRA_16X16_CHROMA_CTRL_DEBUG_STATE_S  14
/** H264_INTRA_4X4_CTRL_DEBUG_STATE : RO; bitpos: [21:18]; default: 0;
 *  Represents intra_4x4_ctrl module FSM info.
 */
#define H264_INTRA_4X4_CTRL_DEBUG_STATE    0x0000000FU
#define H264_INTRA_4X4_CTRL_DEBUG_STATE_M  (H264_INTRA_4X4_CTRL_DEBUG_STATE_V << H264_INTRA_4X4_CTRL_DEBUG_STATE_S)
#define H264_INTRA_4X4_CTRL_DEBUG_STATE_V  0x0000000FU
#define H264_INTRA_4X4_CTRL_DEBUG_STATE_S  18
/** H264_INTRA_TOP_CTRL_DEBUG_STATE : RO; bitpos: [24:22]; default: 0;
 *  Represents intra_top_ctrl module FSM info.
 */
#define H264_INTRA_TOP_CTRL_DEBUG_STATE    0x00000007U
#define H264_INTRA_TOP_CTRL_DEBUG_STATE_M  (H264_INTRA_TOP_CTRL_DEBUG_STATE_V << H264_INTRA_TOP_CTRL_DEBUG_STATE_S)
#define H264_INTRA_TOP_CTRL_DEBUG_STATE_V  0x00000007U
#define H264_INTRA_TOP_CTRL_DEBUG_STATE_S  22
/** H264_IME_CTRL_DEBUG_STATE : RO; bitpos: [27:25]; default: 0;
 *  Represents ime_ctrl module FSM info.
 */
#define H264_IME_CTRL_DEBUG_STATE    0x00000007U
#define H264_IME_CTRL_DEBUG_STATE_M  (H264_IME_CTRL_DEBUG_STATE_V << H264_IME_CTRL_DEBUG_STATE_S)
#define H264_IME_CTRL_DEBUG_STATE_V  0x00000007U
#define H264_IME_CTRL_DEBUG_STATE_S  25

/** H264_DEBUG_INFO1_REG register
 *  Debug information register1.
 */
#define H264_DEBUG_INFO1_REG (DR_REG_H264_BASE + 0xe8)
/** H264_FME_CTRL_DEBUG_STATE : RO; bitpos: [2:0]; default: 0;
 *  Represents fme_ctrl module FSM info.
 */
#define H264_FME_CTRL_DEBUG_STATE    0x00000007U
#define H264_FME_CTRL_DEBUG_STATE_M  (H264_FME_CTRL_DEBUG_STATE_V << H264_FME_CTRL_DEBUG_STATE_S)
#define H264_FME_CTRL_DEBUG_STATE_V  0x00000007U
#define H264_FME_CTRL_DEBUG_STATE_S  0
/** H264_DECI_CALC_DEBUG_STATE : RO; bitpos: [4:3]; default: 0;
 *  Represents deci_calc module's FSM info. DEV use only.
 */
#define H264_DECI_CALC_DEBUG_STATE    0x00000003U
#define H264_DECI_CALC_DEBUG_STATE_M  (H264_DECI_CALC_DEBUG_STATE_V << H264_DECI_CALC_DEBUG_STATE_S)
#define H264_DECI_CALC_DEBUG_STATE_V  0x00000003U
#define H264_DECI_CALC_DEBUG_STATE_S  3
/** H264_DB_DEBUG_STATE : RO; bitpos: [7:5]; default: 0;
 *  Represents db module FSM info.
 */
#define H264_DB_DEBUG_STATE    0x00000007U
#define H264_DB_DEBUG_STATE_M  (H264_DB_DEBUG_STATE_V << H264_DB_DEBUG_STATE_S)
#define H264_DB_DEBUG_STATE_V  0x00000007U
#define H264_DB_DEBUG_STATE_S  5
/** H264_CAVLC_ENC_DEBUG_STATE : RO; bitpos: [11:8]; default: 0;
 *  Represents cavlc module enc FSM info.
 */
#define H264_CAVLC_ENC_DEBUG_STATE    0x0000000FU
#define H264_CAVLC_ENC_DEBUG_STATE_M  (H264_CAVLC_ENC_DEBUG_STATE_V << H264_CAVLC_ENC_DEBUG_STATE_S)
#define H264_CAVLC_ENC_DEBUG_STATE_V  0x0000000FU
#define H264_CAVLC_ENC_DEBUG_STATE_S  8
/** H264_CAVLC_SCAN_DEBUG_STATE : RO; bitpos: [15:12]; default: 0;
 *  Represents cavlc module scan FSM info.
 */
#define H264_CAVLC_SCAN_DEBUG_STATE    0x0000000FU
#define H264_CAVLC_SCAN_DEBUG_STATE_M  (H264_CAVLC_SCAN_DEBUG_STATE_V << H264_CAVLC_SCAN_DEBUG_STATE_S)
#define H264_CAVLC_SCAN_DEBUG_STATE_V  0x0000000FU
#define H264_CAVLC_SCAN_DEBUG_STATE_S  12
/** H264_CAVLC_CTRL_DEBUG_STATE : RO; bitpos: [17:16]; default: 0;
 *  Represents cavlc module ctrl FSM info.
 */
#define H264_CAVLC_CTRL_DEBUG_STATE    0x00000003U
#define H264_CAVLC_CTRL_DEBUG_STATE_M  (H264_CAVLC_CTRL_DEBUG_STATE_V << H264_CAVLC_CTRL_DEBUG_STATE_S)
#define H264_CAVLC_CTRL_DEBUG_STATE_V  0x00000003U
#define H264_CAVLC_CTRL_DEBUG_STATE_S  16
/** H264_BS_BUFFER_DEBUG_STATE : RO; bitpos: [18]; default: 0;
 *  Represents bs buffer overflow info.
 */
#define H264_BS_BUFFER_DEBUG_STATE    (BIT(18))
#define H264_BS_BUFFER_DEBUG_STATE_M  (H264_BS_BUFFER_DEBUG_STATE_V << H264_BS_BUFFER_DEBUG_STATE_S)
#define H264_BS_BUFFER_DEBUG_STATE_V  0x00000001U
#define H264_BS_BUFFER_DEBUG_STATE_S  18

/** H264_DEBUG_INFO2_REG register
 *  Debug information register2.
 */
#define H264_DEBUG_INFO2_REG (DR_REG_H264_BASE + 0xec)
/** H264_P_RC_DONE_DEBUG_FLAG : RO; bitpos: [0]; default: 0;
 *  Represents p rate ctrl done status.\\0: not done\\1: done.
 */
#define H264_P_RC_DONE_DEBUG_FLAG    (BIT(0))
#define H264_P_RC_DONE_DEBUG_FLAG_M  (H264_P_RC_DONE_DEBUG_FLAG_V << H264_P_RC_DONE_DEBUG_FLAG_S)
#define H264_P_RC_DONE_DEBUG_FLAG_V  0x00000001U
#define H264_P_RC_DONE_DEBUG_FLAG_S  0
/** H264_P_P_I_CMP_DONE_DEBUG_FLAG : RO; bitpos: [1]; default: 0;
 *  Represents p p_i_cmp done status.\\0: not done\\1: done.
 */
#define H264_P_P_I_CMP_DONE_DEBUG_FLAG    (BIT(1))
#define H264_P_P_I_CMP_DONE_DEBUG_FLAG_M  (H264_P_P_I_CMP_DONE_DEBUG_FLAG_V << H264_P_P_I_CMP_DONE_DEBUG_FLAG_S)
#define H264_P_P_I_CMP_DONE_DEBUG_FLAG_V  0x00000001U
#define H264_P_P_I_CMP_DONE_DEBUG_FLAG_S  1
/** H264_P_MV_MERGE_DONE_DEBUG_FLAG : RO; bitpos: [2]; default: 0;
 *  Represents p mv merge done status.\\0: not done\\1: done.
 */
#define H264_P_MV_MERGE_DONE_DEBUG_FLAG    (BIT(2))
#define H264_P_MV_MERGE_DONE_DEBUG_FLAG_M  (H264_P_MV_MERGE_DONE_DEBUG_FLAG_V << H264_P_MV_MERGE_DONE_DEBUG_FLAG_S)
#define H264_P_MV_MERGE_DONE_DEBUG_FLAG_V  0x00000001U
#define H264_P_MV_MERGE_DONE_DEBUG_FLAG_S  2
/** H264_P_MOVE_ORI_DONE_DEBUG_FLAG : RO; bitpos: [3]; default: 0;
 *  Represents p move origin done status.\\0: not done\\1: done.
 */
#define H264_P_MOVE_ORI_DONE_DEBUG_FLAG    (BIT(3))
#define H264_P_MOVE_ORI_DONE_DEBUG_FLAG_M  (H264_P_MOVE_ORI_DONE_DEBUG_FLAG_V << H264_P_MOVE_ORI_DONE_DEBUG_FLAG_S)
#define H264_P_MOVE_ORI_DONE_DEBUG_FLAG_V  0x00000001U
#define H264_P_MOVE_ORI_DONE_DEBUG_FLAG_S  3
/** H264_P_MC_DONE_DEBUG_FLAG : RO; bitpos: [4]; default: 0;
 *  Represents p mc done status.\\0: not done\\1: done.
 */
#define H264_P_MC_DONE_DEBUG_FLAG    (BIT(4))
#define H264_P_MC_DONE_DEBUG_FLAG_M  (H264_P_MC_DONE_DEBUG_FLAG_V << H264_P_MC_DONE_DEBUG_FLAG_S)
#define H264_P_MC_DONE_DEBUG_FLAG_V  0x00000001U
#define H264_P_MC_DONE_DEBUG_FLAG_S  4
/** H264_P_IME_DONE_DEBUG_FLAG : RO; bitpos: [5]; default: 0;
 *  Represents p ime done status.\\0: not done\\1: done.
 */
#define H264_P_IME_DONE_DEBUG_FLAG    (BIT(5))
#define H264_P_IME_DONE_DEBUG_FLAG_M  (H264_P_IME_DONE_DEBUG_FLAG_V << H264_P_IME_DONE_DEBUG_FLAG_S)
#define H264_P_IME_DONE_DEBUG_FLAG_V  0x00000001U
#define H264_P_IME_DONE_DEBUG_FLAG_S  5
/** H264_P_GET_ORI_DONE_DEBUG_FLAG : RO; bitpos: [6]; default: 0;
 *  Represents p get origin done status.\\0: not done\\1: done.
 */
#define H264_P_GET_ORI_DONE_DEBUG_FLAG    (BIT(6))
#define H264_P_GET_ORI_DONE_DEBUG_FLAG_M  (H264_P_GET_ORI_DONE_DEBUG_FLAG_V << H264_P_GET_ORI_DONE_DEBUG_FLAG_S)
#define H264_P_GET_ORI_DONE_DEBUG_FLAG_V  0x00000001U
#define H264_P_GET_ORI_DONE_DEBUG_FLAG_S  6
/** H264_P_FME_DONE_DEBUG_FLAG : RO; bitpos: [7]; default: 0;
 *  Represents p fme done status.\\0: not done\\1: done.
 */
#define H264_P_FME_DONE_DEBUG_FLAG    (BIT(7))
#define H264_P_FME_DONE_DEBUG_FLAG_M  (H264_P_FME_DONE_DEBUG_FLAG_V << H264_P_FME_DONE_DEBUG_FLAG_S)
#define H264_P_FME_DONE_DEBUG_FLAG_V  0x00000001U
#define H264_P_FME_DONE_DEBUG_FLAG_S  7
/** H264_P_FETCH_DONE_DEBUG_FLAG : RO; bitpos: [8]; default: 0;
 *  Represents p fetch done status.\\0: not done\\1: done.
 */
#define H264_P_FETCH_DONE_DEBUG_FLAG    (BIT(8))
#define H264_P_FETCH_DONE_DEBUG_FLAG_M  (H264_P_FETCH_DONE_DEBUG_FLAG_V << H264_P_FETCH_DONE_DEBUG_FLAG_S)
#define H264_P_FETCH_DONE_DEBUG_FLAG_V  0x00000001U
#define H264_P_FETCH_DONE_DEBUG_FLAG_S  8
/** H264_P_DB_DONE_DEBUG_FLAG : RO; bitpos: [9]; default: 0;
 *  Represents p deblocking done status.\\0: not done\\1: done.
 */
#define H264_P_DB_DONE_DEBUG_FLAG    (BIT(9))
#define H264_P_DB_DONE_DEBUG_FLAG_M  (H264_P_DB_DONE_DEBUG_FLAG_V << H264_P_DB_DONE_DEBUG_FLAG_S)
#define H264_P_DB_DONE_DEBUG_FLAG_V  0x00000001U
#define H264_P_DB_DONE_DEBUG_FLAG_S  9
/** H264_P_BS_BUF_DONE_DEBUG_FLAG : RO; bitpos: [10]; default: 0;
 *  Represents p bitstream buffer done status.\\0: not done\\1: done.
 */
#define H264_P_BS_BUF_DONE_DEBUG_FLAG    (BIT(10))
#define H264_P_BS_BUF_DONE_DEBUG_FLAG_M  (H264_P_BS_BUF_DONE_DEBUG_FLAG_V << H264_P_BS_BUF_DONE_DEBUG_FLAG_S)
#define H264_P_BS_BUF_DONE_DEBUG_FLAG_V  0x00000001U
#define H264_P_BS_BUF_DONE_DEBUG_FLAG_S  10
/** H264_REF_MOVE_2MB_LINE_DONE_DEBUG_FLAG : RO; bitpos: [11]; default: 0;
 *  Represents dma move 2 ref mb line done status.\\0: not done\\1: done.
 */
#define H264_REF_MOVE_2MB_LINE_DONE_DEBUG_FLAG    (BIT(11))
#define H264_REF_MOVE_2MB_LINE_DONE_DEBUG_FLAG_M  (H264_REF_MOVE_2MB_LINE_DONE_DEBUG_FLAG_V << H264_REF_MOVE_2MB_LINE_DONE_DEBUG_FLAG_S)
#define H264_REF_MOVE_2MB_LINE_DONE_DEBUG_FLAG_V  0x00000001U
#define H264_REF_MOVE_2MB_LINE_DONE_DEBUG_FLAG_S  11
/** H264_I_P_I_CMP_DONE_DEBUG_FLAG : RO; bitpos: [12]; default: 0;
 *  Represents I p_i_cmp done status.\\0: not done\\1: done.
 */
#define H264_I_P_I_CMP_DONE_DEBUG_FLAG    (BIT(12))
#define H264_I_P_I_CMP_DONE_DEBUG_FLAG_M  (H264_I_P_I_CMP_DONE_DEBUG_FLAG_V << H264_I_P_I_CMP_DONE_DEBUG_FLAG_S)
#define H264_I_P_I_CMP_DONE_DEBUG_FLAG_V  0x00000001U
#define H264_I_P_I_CMP_DONE_DEBUG_FLAG_S  12
/** H264_I_MOVE_ORI_DONE_DEBUG_FLAG : RO; bitpos: [13]; default: 0;
 *  Represents I move origin done status.\\0: not done\\1: done.
 */
#define H264_I_MOVE_ORI_DONE_DEBUG_FLAG    (BIT(13))
#define H264_I_MOVE_ORI_DONE_DEBUG_FLAG_M  (H264_I_MOVE_ORI_DONE_DEBUG_FLAG_V << H264_I_MOVE_ORI_DONE_DEBUG_FLAG_S)
#define H264_I_MOVE_ORI_DONE_DEBUG_FLAG_V  0x00000001U
#define H264_I_MOVE_ORI_DONE_DEBUG_FLAG_S  13
/** H264_I_GET_ORI_DONE_DEBUG_FLAG : RO; bitpos: [14]; default: 0;
 *  Represents I get origin done status.\\0: not done\\1: done.
 */
#define H264_I_GET_ORI_DONE_DEBUG_FLAG    (BIT(14))
#define H264_I_GET_ORI_DONE_DEBUG_FLAG_M  (H264_I_GET_ORI_DONE_DEBUG_FLAG_V << H264_I_GET_ORI_DONE_DEBUG_FLAG_S)
#define H264_I_GET_ORI_DONE_DEBUG_FLAG_V  0x00000001U
#define H264_I_GET_ORI_DONE_DEBUG_FLAG_S  14
/** H264_I_EC_DONE_DEBUG_FLAG : RO; bitpos: [15]; default: 0;
 *  Represents I encoder done status.\\0: not done\\1: done.
 */
#define H264_I_EC_DONE_DEBUG_FLAG    (BIT(15))
#define H264_I_EC_DONE_DEBUG_FLAG_M  (H264_I_EC_DONE_DEBUG_FLAG_V << H264_I_EC_DONE_DEBUG_FLAG_S)
#define H264_I_EC_DONE_DEBUG_FLAG_V  0x00000001U
#define H264_I_EC_DONE_DEBUG_FLAG_S  15
/** H264_I_DB_DONE_DEBUG_FLAG : RO; bitpos: [16]; default: 0;
 *  Represents I deblocking done status.\\0: not done\\1: done.
 */
#define H264_I_DB_DONE_DEBUG_FLAG    (BIT(16))
#define H264_I_DB_DONE_DEBUG_FLAG_M  (H264_I_DB_DONE_DEBUG_FLAG_V << H264_I_DB_DONE_DEBUG_FLAG_S)
#define H264_I_DB_DONE_DEBUG_FLAG_V  0x00000001U
#define H264_I_DB_DONE_DEBUG_FLAG_S  16
/** H264_I_BS_BUF_DONE_DEBUG_FLAG : RO; bitpos: [17]; default: 0;
 *  Represents I bitstream buffer done status.\\0: not done\\1: done.
 */
#define H264_I_BS_BUF_DONE_DEBUG_FLAG    (BIT(17))
#define H264_I_BS_BUF_DONE_DEBUG_FLAG_M  (H264_I_BS_BUF_DONE_DEBUG_FLAG_V << H264_I_BS_BUF_DONE_DEBUG_FLAG_S)
#define H264_I_BS_BUF_DONE_DEBUG_FLAG_V  0x00000001U
#define H264_I_BS_BUF_DONE_DEBUG_FLAG_S  17

/** H264_DATE_REG register
 *  Version control register
 */
#define H264_DATE_REG (DR_REG_H264_BASE + 0xf0)
/** H264_LEDC_DATE : R/W; bitpos: [27:0]; default: 36717120;
 *  Configures the version.
 */
#define H264_LEDC_DATE    0x0FFFFFFFU
#define H264_LEDC_DATE_M  (H264_LEDC_DATE_V << H264_LEDC_DATE_S)
#define H264_LEDC_DATE_V  0x0FFFFFFFU
#define H264_LEDC_DATE_S  0

#ifdef __cplusplus
}
#endif
